{
  "scraped_at": "2026-02-16T22:47:56.683727",
  "total_jobs": 90,
  "jobs": [
    {
      "url": "https://www.naukrigulf.com/account-delivery-manager-with-italian-jobs-in-tunisia-in-hewlett-packard-5-to-7-years-n-cd-10001411-jid-160226500983",
      "title": "Account Delivery Manager with Italian",
      "company": "Hewlett-Packard",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "16 hrs ago",
      "description_preview": "Manage on-site software service delivery, ensuring customer satisfaction through technical support, relationship building, and proactive problem-solving while leveraging advance...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nJob Family Definition:\nWithin the family there is a range of technical and managerial customer on-site functions. The family of jobs is focused on managing the onsite delivering of software services, pre-sales, post-sales or service delivery support, installation and configuration for customer environments. The jobs solve various business systems, networking and applications problems for standard industry servers, specialized or complex clustered environments. Deliver reactive and proactive activities according to Service Level Agreement to ensure customer satisfaction and loyalty. Provides direct post-sales systems on site technical support for reactive and proactive customers. Each position maintains a high level of customer satisfaction by ensuring clear business and technical solution alignment, clarifying customer needs and ensuring that they are met. Jobs are responsible for company Total Customer Experience as well as the revenue growth, profitability, and account retention.\nManagement Level Definition:\nApplies developed subject matter knowledge to solve common and complex business issues and recommends appropriate alternatives. Works on problems of diverse complexity and scope. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision making process. Exercises independent judgment to identify and select a solution. Ability to handle most unique situations. May seek advice in order to make decisions on complex business issues.\nResponsibilities:\nApply advanced technical knowledge to operate one or more technology areas (e.g. server administration, technical security management, performance management) or customer groups that are critical or high- risk.\nIntegrate technical knowledge and business understanding to create. solutions for customers.\nResolve single- and cross- technology incidents independently. Work with team members to resolve unusually complex or cross- technology incidents.\nProactively and reactively look for solutions to prevent problems from occurring in team/technology area.\nApply company solutions to meet highly complex customer needs.\nIdentify additional services that could lead to future service revenue growth.\nProvide technical consulting during contract renewal discussions.\nBuild and maintain strong relationship up to senior management level in assigned accounts.\nDesign and deliver support solutions using specific industry knowledge and expertise.\nAssist in managing delivery of industry support solutions.\nLead Customer Expectation management as part of escalation process.\nLead cross-team or large programs/projects.\nCoach or guide junior consultants.\nKnowledge and Skills:\nThorough knowledge of company products and services offerings, company organization, competition, third party products and market trends.\nBroad knowledge of corporate organization, job, and policies.\nComprehensive business, technical or functional knowledge at an expert level.\nCommunicate tactfully with diplomacy up to senior management levels within an organization.\nActive listening skills and ability to adjust messages to audience level.\nProblem-solving skills (proactive, reactive and creative).\nAble to employ exemplary consulting skills by becoming a trusted advisor to the customer and providing clarity to solution determination.\nWell versed in core technical competencies and peaked in some technical area(s) intermediate skills in project management, communication, analysis and presentation.\nProvide suggestions for operational efficiencies."
    },
    {
      "url": "https://www.naukrigulf.com/account-support-manager-with-italian-jobs-in-tunisia-in-hewlett-packard-5-to-10-years-n-cd-10001411-jid-160226500982",
      "title": "Account Support Manager with Italian",
      "company": "Hewlett-Packard",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "16 hrs ago",
      "description_preview": "Manage customer support and technical solutions, ensuring satisfaction and account retention while possessing advanced technical knowledge and fluency in Italian.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nJob Family Definition:\nWithin the family there is a range of technical and managerial customer on-site functions. The family of jobs is focused on managing the onsite delivering of software services, pre-sales, post-sales or service delivery support, installation and configuration for customer environments. The jobs solve various business systems, networking and applications problems for standard industry servers, specialized or complex clustered environments. Deliver reactive and proactive activities according to Service Level Agreement to ensure customer satisfaction and loyalty. Provides direct post-sales systems on site technical support for reactive and proactive customers. Each position maintains a high level of customer satisfaction by ensuring clear business and technical solution alignment, clarifying customer needs and ensuring that they are met. Jobs are responsible for company Total Customer Experience as well as the revenue growth, profitability, and account retention.\nManagement Level Definition:\nApplies developed subject matter knowledge to solve common and complex business issues and recommends appropriate alternatives. Works on problems of diverse complexity and scope. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision making process. Exercises independent judgment to identify and select a solution. Ability to handle most unique situations. May seek advice in order to make decisions on complex business issues.\nResponsibilities:\nApply advanced technical knowledge to operate one or more technology areas (e.g. server administration, technical security management, performance management) or customer groups that are critical or high- risk.\nIntegrate technical knowledge and business understanding to create. solutions for customers.\nResolve single- and cross- technology incidents independently. Work with team members to resolve unusually complex or cross- technology incidents.\nProactively and reactively look for solutions to prevent problems from occurring in team/technology area.\nApply company solutions to meet highly complex customer needs.\nIdentify additional services that could lead to future service revenue growth.\nProvide technical consulting during contract renewal discussions.\nBuild and maintain strong relationship up to senior management level in assigned accounts.\nDesign and deliver support solutions using specific industry knowledge and expertise.\nAssist in managing delivery of industry support solutions.\nLead Customer Expectation management as part of escalation process.\nLead cross-team or large programs/projects.\nCoach or guide junior consultants.\nEducation and Experience Required:\nBachelor's degree preferred or Associate degree holder (technical field) with 5- 7 years working experience in related fields desired.\nKnowledge and Skills:\nThorough knowledge of company products and services offerings, company organization, competition, third party products and market trends.\nBroad knowledge of corporate organization, job, and policies.\nComprehensive business, technical or functional knowledge at an expert level.\nCommunicate tactfully with diplomacy up to senior management levels within an organization.\nActive listening skills and ability to adjust messages to audience level.\nProblem-solving skills (proactive, reactive and creative).\nAble to employ exemplary consulting skills by becoming a trusted advisor to the customer and providing clarity to solution determination.\nWell versed in core technical competencies and peaked in some technical area(s) intermediate skills in project management, communication, analysis and presentation.\nProvide suggestions for operational efficiencies."
    },
    {
      "url": "https://www.naukrigulf.com/business-operations-lead-tunis-hub-jobs-in-tunisia-in-hewlett-packard-8-to-13-years-n-cd-10001411-jid-110226500800",
      "title": "Business Operations Lead Tunis HUB",
      "company": "Hewlett-Packard",
      "experience": "8 - 13 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "11 Feb",
      "description_preview": "Lead operational excellence and transformation initiatives, driving governance, performance management, and innovation to optimize customer experience and organizational perform...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nWe are looking for Business Operations Lead Tunis HUB to join our team!\nLead and orchestrate operational excellence for the Global Technical Support Tunis HUB and Geos by driving governance, performance management, and transformation initiatives. Act as the strategic enabler and single point of accountability for operational processes, ensuring alignment with corporate objectives and bold goals. Deliver executive-level business reviews, foster collaboration across hubs, and champion innovation through automation, analytics, and continuous improvement to optimize customer experience and organizational performance.\nHow you will make your mark:\nOperational Excellence & Governance\nDeploy and measure Objectives and Key Results (OKRs) aligned with Business bold goals.\nDefine and track KPIs across Global Technical Support.\nDrive performance reviews and ensure alignment with organizational goals.\nLead operational excellence through standardization, simplification, and automation of business processes.\nOwn HUB governance and policies, ensuring compliance and driving metrics leadership.\nEnable end-to-end customer experience through analytics, insights, and dashboards.\nStandardize processes, enforce compliance, and mitigate risks.\nCollaborate with Ops Leads, SME s and hubs globally to ensure operational excellence.\nPrepare and deliver Quarterly Business Reviews (QBRs) and organizational performance reports for senior leadership.\nConsolidate insights into clear, actionable narratives for executive decision-making.\nStrategy, Planning & Transformation\nDrive internal transformation projects across the organization.\nDrive cost optimization and ROI tracking for transformation projects.\nDrive financial discipline across the organization.\nBuild and lead current and future Cap-Cap models.\nEnsure timely delivery of milestones and adoption of new processes.\nOwn and deploy the Organization s Plan of Record (PoR).\nContribute to strategic planning and governance frameworks that optimize operational performance.\nAlign resource planning with business priorities.\nAlign operational priorities with corporate objectives and transformation roadmaps.\nServe as the bridge between business strategy and execution, ensuring operational readiness for growth initiatives.\nPromote collaboration across HPE Operations and hubs.\nInnovation & Continuous Improvement\nChampion innovation and automation initiatives to modernize operations.\nIncubate ideas for process automation, AI-driven analytics, and digital transformation.\nIdentify opportunities for process optimization and digital transformation.\nDrive operational maturity assessments and benchmark against industry best practices."
    },
    {
      "url": "https://www.naukrigulf.com/salesforce-business-analyst-jobs-in-tunis-tunisia-in-questel-2-to-6-years-n-cd-40001777-jid-090226500561",
      "title": "Salesforce Business Analyst",
      "company": "Questel",
      "experience": "2 - 6 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "9 Feb",
      "description_preview": "The role involves analyzing business needs, documenting requirements, conducting testing, and improving Salesforce processes while collaborating with stakeholders and teams.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40001777/40001777_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nPosition Overview:\nThe Salesforce Business Analyst is responsible for analyzing, translating, and documenting business needs to support the implementation and optimization of Salesforce-based platforms, including Equinox Corporate+ and Equinox Invention. Acting as a bridge between business and technology, this role ensures that functional requirements are clearly defined, and solutions are delivered to meet end-user expectations.\nPrincipal Duties & Responsibilities:\n\nCollaborate with internal stakeholders and Solution Engineers to gather, analyze, and document functional requirements\n\nTranslate business needs into user stories and define acceptance criteria for development and testing\n\nOrganize and lead functional testing campaigns and user acceptance testing (UAT) in sandbox and Trials environments\n\nCoordinate with Salesforce administrators and developers on deployment activities, including Change Sets, Salesforce CLI, and Git workflows\n\nValidate successful implementation of new features, proactively monitor actions, and resolve any post-deployment issues\n\nIdentify opportunities for continuous improvement of Salesforce business processes and platform usability\n\nMaintain user documentation and functional documentation and user guides to promote the adoption of implemented solutions\n\nParticipate in Agile ceremonies and ensure alignment between solutions and business priorities\n\nStay current on Salesforce platform developments and assess potential impact on current systems\n\nCollaborate with cross-functional teams and R&D teams supporting the Orbit Invention platforms to support functional evolution and optimization\n\nWork on special projects and other duties as assigned by management\n\nQualifications & Skills:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential function.\nEducation and Experience: Bachelor s degree in Business Administration, Information Systems, Computer Science, or a related field preferred; or any combination of education, experience and training which provides the following knowledge, skills and abilities:\n\nMinimum 2 years of experience in Salesforce functional analysis and implementation required\n\nSalesforce Business Analyst Certification preferred\n\nProficient in Salesforce native tools such as Flows, Validation Rules, and Custom Objects\n\nUnderstanding of APEX and SOQL\n\nFamiliar with Salesforce Sandbox Management, Change Sets, Salesforce CLI, and Git\n\nExperience using tools such as JIRA, Confluence, and working within Agile/Scrum frameworks\n\nStrong analytical, organizational, and documentation skills\n\nExcellent verbal and written communication in English\n\nSelf-starter with the ability to work independently and collaboratively across teams\n\nEffective at managing multiple priorities in a fast-paced, global environment\n\nAdaptable, solutions-oriented and proactive in identifying improvements\n\nThis job description may evolve based on business needs."
    },
    {
      "url": "https://www.naukrigulf.com/marketing-intern-mea-jobs-in-tunis-tunisia-in-sbs-software-1-to-2-years-n-cd-40003719-jid-090226500021",
      "title": "Marketing Intern MEA",
      "company": "SBS Software",
      "experience": "1 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "9 Feb",
      "description_preview": "Assist in implementing marketing plans, organizing events, coordinating with teams, and analyzing campaign performance; requires strong organizational skills and fluency in Fren...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40003719/40003719_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\nJob Description\nOur international and collaborative marketing team designs and implements digital campaigns, events, go-to-market strategies, and communication programs that enhance the global visibility of the SBS brand. As a marketing intern for the MEA region , you will work closely with the sales and marketing teams to develop and implement local initiatives that directly support business growth.\nYour tasks\nContribute to the implementation of the operational marketing plan for the MEA region.\nHelping with event organization.\nEnsure coordination with agencies, suppliers and service providers to guarantee quality and adherence to deadlines.\nEnsure the monitoring of local campaigns (emails, content, sales materials, localized social networks).\nMonitor and analyze the performance of field activities (reports, measurement of return on investment, recommendations).\nEnsure continuous monitoring of key achievements in the region (new contracts, strategic signings, go lives, business milestones).\nCoordinate with local teams (sales, delivery, management) to collect, qualify and validate information.\nQualifications\nCurrently enrolled in a bachelor's or master's degree (M1/M2) in marketing, business, communication or a related field.\nStrong organizational skills, attention to detail and a proactive mindset.\nExcellent interpersonal and writing skills.\nProficient in PowerPoint and Excel; experience with CRM or marketing automation tools is a plus.\nFluency in French and English is required."
    },
    {
      "url": "https://www.naukrigulf.com/release-manager-jobs-in-tunis-tunisia-in-neoxam-tunisie-3-to-8-years-n-cd-40001082-jid-030226501119",
      "title": "Release Manager",
      "company": "NeoXam Tunisie",
      "experience": "3 - 8 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "3 Feb",
      "description_preview": "Responsible for planning and managing software releases, ensuring quality and coordination among teams, with expertise in SDLC, Agile, and CI/CD.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40001082/40001082_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAs part of NeoXam s R&D department, the Release Manager is responsible for planning, coordinating, and managing DataHub software releases across multiple environments and projects. This role ensures smooth deployment of new features, enhancements, and fixes by aligning development, testing, and business teams. The Release Manager oversees the end-to-end release lifecycle from planning and build integration to testing, deployment, and post-release validation ensuring minimal disruption and maximum quality.\nMISSION\nRelease Planning & Governance\nDefine, document, and manage the overall release calendar across multiple stakeholders.\nCollaborate with product owners, development leads, and the QA team to identify release scope and dependencies.\nEstablish and maintain release governance standards, policies, and processes.\nCoordination & Communication\nAct as the central point of contact for all release-related activities and communications.\nFacilitate release readiness reviews, go/no-go meetings, and post-release retrospectives.\nCommunicate release scope, milestones, and risks to all stakeholders.\nRelease Execution & Deployment\nCoordinate build deployments and ensure version control, tagging, and release documentation are properly maintained.\nManage deployment pipelines (CI/CD) in collaboration with DevOps and Infrastructure teams.\nEnsure rollback, recovery, and contingency procedures are in place and tested.\nQuality & Risk Management\nMonitor release quality by aligning with QA team on testing outcomes and defect tracking.\nIdentify potential risks and conflicts early in the release cycle and drive mitigation strategies.\nTrack release metrics (success rate, failure rate, deployment time, etc.) to improve future performance.\nAutomation & Continuous Improvement\nPartner with DevOps to streamline and automate release processes where feasible.\nContinuously review and enhance release processes for efficiency, predictability, and scalability.\nPROFILE\nStrong understanding of SDLC, Agile, DevOps, and CI/CD principles.\nExcellent organizational and stakeholder management skills.\nHands-on experience with release tools such as Jira, Git, Bitbucket, Jenkins, Artifactory, good to have Azure DevOps, or GitLab CI/CD.\nProven experience managing releases across multiple environments and teams (DEV, QA, UAT, PROD).\nStrong analytical and problem-solving abilities.\nProven ability to work under pressure and manage multiple concurrent releases.\nIt s even better if you have :\nExperience in regulated industries (finance, healthcare, etc.) with controlled release processes.\nPMO, Agile/Scrum or ITIL certification(s)\nFamiliarity with cloud environments (AWS, Azure, GCP).\nWe are looking for a highly rigorous and persistent professional with excellent communication skills and the ability to drive and promote best practices across teams.\nYou will also bring a continuous improvement mindset and strong capabilities in risk management and issue resolution to support the team s performance and long-term success.\nWHAT WE OFFER\nA permanent contract (CDI).\nA pleasant and collaborative work environment, where team spirit is key.\nAn attractive compensation package, including a fixed salary, performance bonus, meal vouchers, health and life insurance.\nA flexible and hybrid work model, combining remote work and on-site presence.\nAnd much more..."
    },
    {
      "url": "https://www.naukrigulf.com/junior-devops-engineer-jobs-in-tunisia-in-think-tank-business-solutions-ag-1-to-3-years-n-cd-40002442-jid-290126501720",
      "title": "Junior DevOps Engineer",
      "company": "think tank Business Solutions AG",
      "experience": "1 - 3 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "29 Jan",
      "description_preview": "Responsible for developing cloud computing solutions, performing application maintenance, and utilizing DevOps tools with strong programming and communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40002442/40002442_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nResponsibilities:\nResponsible for working with development teams to translate scalability, performance, reliability, and functional requirements to virtualized/cloud computing solutions with strong capacity in the management of cloud computing clusters.\nYou will be responsible for routine application maintenance tasks, create requirements and procedures for implementing routine maintenance and troubleshooting existing information systems for errors, and resolving errors\nYou will be responsible for developing and building IT solutions and installing and configure solutions, implement reusable components, translate technical requirements, assist with all stages of test data, develop interface stubs and simulators, and perform script maintenance and updates,\nParticipate in the processes of strategic project-planning meetings and providing guidance and expertise on system options,\nQualifications:\nKnowledge of best practices in support of IT operations and a good understanding of programming languages, including Java, br>\nHands-on experience with configuration and use of DevOps tools and software process automation with popular scripting languages (Perl, python, ruby, shell, javascript ..).br>\nProficiency in Cloud Services: Amazon web services. Microsoft Cloud Azure, Google Cloud, ../\nGood understanding of System Administration: Monitoring Tools, Networking concepts, Backups.br>\nGood experience in terms of build, release, and configuration management in a CI/CD environment (version control, CM, ).br>\nAbility to work with containerization platforms such as Kubernetes, Docker; cloud provisioning software, including Ansible, br>\nProvide high performance cloud deployment solutions and maintain rapid deployment pipelines,br>\nCurrent understanding of best practices regarding system security measures.br>\nStrong written communications skills are necessary for writing clear and concise documentation also as well as verbal communication skills to relate with team members, clients, and others in a workplace./p>"
    },
    {
      "url": "https://www.naukrigulf.com/l1-storage-support-engineer-with-spanish-jobs-in-tunisia-in-hewlett-packard-0-to-1-year-n-cd-10001411-jid-270126503033",
      "title": "L1 Storage Support Engineer with Spanish",
      "company": "Hewlett-Packard",
      "experience": "0 - 1 Year",
      "location": "Tunisia - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "Provide technical support for hardware and software issues, ensuring customer satisfaction and effective communication in Spanish while resolving problems.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\n\nJob Description:\nWe are looking for L1 Support Engineer with Spanish language to join our team!\nHow you ll make your mark:\nSuccessfully resolve technical issues (hardware and software) from incoming internal or external businesses and end user's contacts and proactive notification systems.\nRespond to service, product, technical, and customer- relations questions on subjects such as features, specifications, and repairs on current and discontinued products, parts, and options, based on customer entitlement (warranty through mission-critical). .\nResolve incoming internal or external businesses and end user's problems via telephone and e-support.\nArticulate both in writing and verbally case summary, resolution and add to Knowledge Management System (KMS).\nProactively assist customers to avoid or reduce problem occurrence.\nRepresent the company in a face to face customer location visit, industry conference/trade show, vendor meeting, etc.\nEngage team members for support as required to ensure internal or external business and end user SLA demands are met.\nBegin to partner with and assist the Sales Pursuit team.\nAbout you:\n0-1 year experience in relevant technologies and customer environments.\nRelevant industry qualification where applicable\nExcellent verbal and written communication skills in language to be supported.\nExperience in troubleshooting in a technical environment.\nExcellent analytical and problem solving skills.\nSoftware and hardware knowledge of computing, storage and peripheral devices.\nAdvanced proficiency with case management databases and tools.\nSuperior customer service skills.\nPhone and remote support experience. E-support experience.\nFluent Spanish language\n\n\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have whether you want to become a knowledge expert in your field or apply your skills to another division.\nUnconditional Inclusion\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know varied backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    },
    {
      "url": "https://www.naukrigulf.com/l1-storage-support-engineer-italian-jobs-in-tunisia-in-hewlett-packard-0-to-1-year-n-cd-10001411-jid-270126500900",
      "title": "L1 Storage Support Engineer Italian",
      "company": "Hewlett-Packard",
      "experience": "0 - 1 Year",
      "location": "Tunisia - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "The role involves resolving technical issues, providing customer support, and requires excellent communication skills in English and Italian.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\nJob Description:\nWe are looking for L1 Storage Support Engineer with Italian language to join our team!\nHow you ll make your mark:\nSuccessfully resolve technical issues (hardware and software) from incoming internal or external businesses and end user's contacts and proactive notification systems.\nRespond to service, product, technical, and customer- relations questions on subjects such as features, specifications, and repairs on current and discontinued products, parts, and options, based on customer entitlement (warranty through mission-critical). .\nResolve incoming internal or external businesses and end user's problems via telephone and e-support.\nArticulate both in writing and verbally case summary, resolution and add to Knowledge Management System (KMS).\nProactively assist customers to avoid or reduce problem occurrence.\nRepresent the company in a face to face customer location visit, industry conference/trade show, vendor meeting, etc.\nEngage team members for support as required to ensure internal or external business and end user SLA demands are met.\nBegin to partner with and assist the Sales Pursuit team.\nAbout you:\n0-1 year experience in relevant technologies and customer environments.\nRelevant industry qualification where applicable\nExcellent verbal and written communication skills in language to be supported.\nExperience in troubleshooting in a technical environment.\nExcellent analytical and problem solving skills.\nSoftware and hardware knowledge of computing, storage and peripheral devices.\nAdvanced proficiency with case management databases and tools.\nSuperior customer service skills.\nPhone and remote support experience. E-support experience.\nFluent English and Italian languages\nAdditional Skills:\nAccountability, Accountability, Action Planning, Active Learning, Active Listening, Bias, Business Growth, Business Planning, Coaching, Commercial Acumen, Creativity, Critical Thinking, Cross-Functional Teamwork, Customer Experience Strategy, Customer Solutions, Data Analysis Management, Data Collection Management (Inactive), Data Controls, Design Thinking, Empathy, Follow-Through, Growth Mindset, Intellectual Curiosity (Inactive), Long Term Planning, Managing Ambiguity {+ 5 more}\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have whether you want to become a knowledge expert in your field or apply your skills to another division.\nUnconditional Inclusion\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know varied backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    },
    {
      "url": "https://www.naukrigulf.com/software-integration-consultant-jobs-in-tunis-tunisia-in-vneuron-3-to-5-years-n-cd-10009202-jid-270126500137",
      "title": "Software Integration Consultant",
      "company": "Vneuron",
      "experience": "3 - 5 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "Implement software integrations, analyze requirements, configure solutions, and document technical implementations while possessing strong analytical and communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nImplement seamless software integrations,analyze requirements, draft specs, configure and develop solutions, connect REIS with client systems, model business rules, support deployment and document technical implementations.\n\n\nAbout Vneuron and Reis RCS\nVneuron is a fast-growing RegTech company helping financial institutions stay ahead of compliance and risk challenges. Our solution, Reis RCS , supports banks and financial services in fighting financial crime through advanced technology.\nIn 2025, Vneuron was named among the Top Innovators in the FinCrimeTech50 and won the Best Compliance as a Service Solution at the RegTech Insight Awards Europe. Weve also been recognized in the RegTech100 for the fourth year in a row a global list of the most innovative companies in the field.\nIf youre looking to join a team thats making a real impact in the world of compliance and technology, Vneuron is the place to be.\n\nOur Culture & Values\nVneuron puts the development of its team at the heart of its priorities. We provide a pleasant and comfortable work environment. Our organization is collaborative and flat-structured. And, our management is available and present.\nMoreover, We have a passionate and committed young team who values respect and sharing spirit. You will be surrounded by highly skilled experts willing to guide you to evolve in all aspects of your career. We aim to spread our innovative technology worldwide, so we can take part in generating a positive impact.\nWe believe that every person is unique and special. Thus, we provide attentive and active listening to your ideas and propositions as we believe that you will have an essential role in achieving our next milestone.\n\nWhy would you love to join us?\nChallenging context to expand your technical and professional skills\nOpportunity to start a promising career\nPleasant and comfortable work environment (Relaxation and play areas)\nWork along with our passionate and brilliant Spark team\nHighly qualified mentor to guide you through the realization of your project\nBeing surrounded by Highly skilled experts in different fields such as Software Architecture, Software Release Management, Software Quality Assurance, Project Management, Consulting, Selling, etc.\nEqual opportunity no matter your gender, religion, culture, color, etc.\n\nResponsibilities:\nAnalyze project requirements while considering the functionalities of the REIS suite.\nContribute to the drafting of technical specification documents.\nPerform configurations and developments required for the implementation of technical and functional requirements.\nIntegrate and implement interfacing mechanisms between the REIS suite and the clients information system.\nModel business rules and implement them in the REIS platform, following best practices.\nEstimate the workload needed to complete the technical part of the project.\nProvide support during the deployment and acceptance testing phases in the clients environment.\nWrite documentation for the implemented technical solutions.\n\nProfile:\nHaving a degree in Computer Science, ideally with a component in Business Management.\nHaving strong analytical skills, allowing for effective modeling and optimal implementation of business needs.\nDemonstrating rigor, method, and a solution-oriented mindset.\nPossessing excellent communication abilities and ease in collaborative environments.\nBeing adaptable and able to perform well under pressure.\nGood knowledge of JavaScript, Postman, Form.io, Freemarker, UML/BPMN, GitLab, SQL, and PostgreSQL.\nGood mastery of data integration mechanisms and tools such as Talend/ETL and Spring Integration.\nProficient in Microsoft Office tools.\n\nBenefits :\nThe opportunity to work on exciting projects that are generating a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment where diversity is applauded, and success is celebrated.\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing and Passion for what it does\nEqual Employment Opportunities : Gender, religious, culture equity\nPossibility to work remotely"
    },
    {
      "url": "https://www.naukrigulf.com/revenue-management-assistant-part-time-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501483",
      "title": "Revenue Management Assistant - Part-time",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Support revenue analysis, monitor key performance indicators, improve billing processes, and validate records; requires finance knowledge and proficiency in Excel.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nSupport revenue analysis and financial reporting.\nMonitor key performance indicators (MRR, TTM, churn rate, etc.).\nAssist in improving billing and collection processes.\nHelp prepare management presentations and reports.\nSupport revenue assurance by validating records against contracts.\n\nMain Responsibilities:\nSupport revenue analysis and financial reporting.\nMonitor key performance indicators (MRR, TTM, churn rate, etc.).\nAssist in improving billing and collection processes.\nHelp prepare management presentations and reports.\nSupport revenue assurance by validating records against contracts."
    },
    {
      "url": "https://www.naukrigulf.com/it-support-engineer-integration-specialist-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501481",
      "title": "IT Support Engineer - Integration Specialist",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Provide personalized IT support, troubleshoot incidents, develop customer relationships, and collaborate on knowledge base enhancement using various technologies.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nApply organizations processes to provide efficient, personalized support for both Tunisian and foreign clients.\nMonitor, troubleshoot and resolve application incidents reported by the client with respect of fixed SLA and deadlines.\nPrioritize and categorize incidents.\nTrack and document issues and resolutions.\nTroubleshoot issues by using the organizations knowledge base and other resources available.\nCollaborate in developing and enriching the organization knowledge base.\nGenerate necessary reports required by the IT department and/or the client.\nHandle escalation and coordination with R&D engineers.\nHandle communication with clients and other support levels.\nHandle new features development and configuration using the system tools and based on client change requests."
    },
    {
      "url": "https://www.naukrigulf.com/revenue-management-analyst-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501479",
      "title": "Revenue Management Analyst",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Monitor and analyze revenue performance, support forecasting models, collaborate with teams, and produce reports; requires strong analytical skills and proficiency in Excel.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMonitor, analyze, and drive revenue performance (MRR, TTM, churn, upsell/cross-sell).\nSupport the design and improvement of forecasting models.\nCollaborate with sales, finance, and product teams to optimize performance.\nProduce regular reports and ad hoc analyses for management.\nInspect ERP data for errors and recommend corrective actions.\nEnsure revenue accuracy by validating financials against contracts.\nPerform variance analysis and provide insights for management.\nContribute to the continuous improvement of revenue management processes."
    },
    {
      "url": "https://www.naukrigulf.com/head-of-r-d-engineering-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501476",
      "title": "Head of R&D Engineering",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Collaborate with the Chief Technology Officer to shape product strategy, lead engineering teams, and develop software using JAVA frameworks and agile methodologies.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nWork along with the CTO to set the roadmap and ensure its proper implementation\nParticipate in shaping product strategy and making technical decisions\nArchitect and develop new functionalities\nCoach and lead technically our engineering team\nEvaluate and improve the performance, maintainability, and security of applications in production.\nWork in an agile environment\nParticipate in team development\nLeading, planning and budgeting projects\nWhat You Wont Be Doing\nYou will not be making any decisions based primarily on saving money.\nYou will not participate in pointless or ineffective meetings. So we give you the time and resources to live your passion.\nYou will not be talking to customers.\nYou will definitely not receive demands from people who dont understand the trade.\nRequired profile\nSignificant experience in the field of software\nSignificant experience with JAVA frameworks (Spring, Hibernate) and Frontendbr>\ntechnologies (Angular, Typescript).\nKnowledge of Elasticsearch and Postgresql technologies\nSolid foundation in computer science, with strong competencies in algorithms, data structures, software design, and building large, distributed systems.\nA good technical curiosity to ensure permanent watch of the most recentbr>\ntechnologies.\nProactive and having a problem-solving mindset\nA good experience in engineering leadership roles\nAbility to guide team members towards optimal problem solving\nAbility to work in an agile environment\nVery good at explaining why and how"
    },
    {
      "url": "https://www.naukrigulf.com/java-technical-lead-jobs-in-tunis-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501475",
      "title": "Java Technical Lead",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Lead and supervise a team in Java development, ensuring code quality, guiding junior developers, and participating in technology choices and software design.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nLead and Supervise technically your team\nGuide your Team through technical issues and challenges\nParticipate in technological choices, design and development of Vneurons products and projects.\nEnsure good code quality and respect the best practices of modern coding\nDevelop work schedules and establish the load and time estimates\nDevelop new software functionalities\nkeep up to date with industry trends\nBring the fruits of your experience to improve the collective effectiveness of the team\nContribute to the recruitment of young developers"
    },
    {
      "url": "https://www.naukrigulf.com/software-business-analyst-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501473",
      "title": "Software Business Analyst",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Analyze customer needs, define solutions, prepare specifications, coordinate teams, and train users, requiring strong communication and analytical skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAnalyze needs, shape solutions, gather and define requirements, lead business discussions, prepare functional specs, align R&D, QA and delivery, coordinate teams and train end-users to ensure smooth adoption and customer satisfaction.\nYou will have the opportunity to work on exciting projects that are generating a positive impact around the world. We believe that every person is unique and special. Thus, we provide an attentive and active listening to your ideas and propositions as we believe that you will have an essential role in shaping the future of Vneuron's value proposition.\nWhat you will be doing ?\nIdentify and collect customers requirements\nConduct business meetings to analyze and frame customers need\nConceive and define the optimal solution for customer need\nPrepare detailed functionnal specifications of the project\nEnsure clear understanding of customers requirements by r&d, QA, and delivery teams\nCoordinate with multidisciplinary teams to ensure customer satisfaction\nEnsure workshops to train final user about our software"
    },
    {
      "url": "https://www.naukrigulf.com/solution-architect-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501470",
      "title": "Solution Architect",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Design solutions and roadmaps, debug issues, document best practices, and communicate with stakeholders; requires software engineering diploma and expertise in JAVA frameworks a...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nDesigning and recommending solutions along with roadmaps for proposed implementations.\nDebugging issues and generating performance analyses for deployed solutions.\nDocumenting and sharing best practices while advocating for process improvements.\nCommunicating with teams, clients, and project stakeholders while providing technical oversight at all project stages."
    },
    {
      "url": "https://www.naukrigulf.com/accounting-assistant-jobs-in-tunis-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126501465",
      "title": "Accounting Assistant",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Manage accounts payable, payroll, and expense reports while ensuring compliance; requires a degree in accounting and strong computer skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nEnsure accounts payable, invoice and expense entry, prepare social and tax declarations, manage payroll, leave and expense reports, while guaranteeing compliance and efficiency in a dynamic environment.\nManage accounts payable, including the entry of purchase invoices, overhead costs and fixed assets.\nClassifying and sorting accounting documents\nPrepare social and tax declarations\nTrack and record expense reports.\nManage leave and monitor absences (schedules, absences, paid leave)\nManage payroll and all administrative aspects (preparation, data entry, calculation, verification)\nConfigure the payroll tool and monitor regulatory changes and the application of social legislation."
    },
    {
      "url": "https://www.naukrigulf.com/growth-hacker-jobs-in-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126501462",
      "title": "Growth Hacker",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Research and identify growth opportunities, optimize marketing tactics, and analyze competitive landscapes while requiring a bachelor's degree and strong communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMissions / What you will do\nResearching and understanding the company's long-term goals.\nPinpointing issues that are hampering growth for the business.\nChoosing, setting, and prioritizing growth goals for the company.\nIdentifying growth opportunities for the company.\nTesting and optimizing marketing tactics for customer acquisition and conversion rate optimization\nConducting and presenting competitive analyses and market research\nProposing new initiatives to attract prospects and convert leads as well as testing new approaches to capture existing demand\nTranslating ideas to actionable items that deliver business results\nAnalyzing, recommending and lead the implementation of improvement initiatives\nKeep abreast with the latest trends and changes in the digital marketing"
    },
    {
      "url": "https://www.naukrigulf.com/cyber-security-analyst-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501459",
      "title": "Cyber Security Analyst",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Assist in vulnerability management, update security policies, support incident response, and contribute to Zero Trust initiatives while possessing a diploma in Cyber Security.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAs a Cyber Security Analyst, you will:\nAssist with the setup and day-to-day management of tools for vulnerability management and threat detection.\nHelp update and maintain security policies, procedures, and standards to stay compliant with best practices and regulations.\nSupport SIEM/SOAR operations by tuning alerts, adjusting rules, and working with DevOps on incident triage.\nTake part in post-incident reviews to evaluate and improve our security controls.\nWork closely with R&D and DevOps to ensure strong access controls, endpoint protection, and patch management.\nUse tools like Microsoft Defender and Azure Security Center to help prioritize remediation efforts based on risk.\nContribute to the rollout and improvement of Zero Trust security initiatives.\nMonitor logs across systems, firewalls, and applications to support timely detection and response to potential threats.\nParticipate in regular risk assessments, documenting findings and suggesting actionable improvements.\nJoin incident response reviews and help implement lessons learned to prevent future issues.\nExplore new security tools and automation opportunities to help us stay ahead of threats.\n\n\nWhy Join Us?\nMake an Impact: Youll help protect critical systems, data, and infrastructure from real-world threats.\nWork with Modern Tools: We use the latest in cloud-native security, automation, and DevSecOps practices."
    },
    {
      "url": "https://www.naukrigulf.com/sales-development-representative-jobs-in-tunis-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501455",
      "title": "Sales Development Representative",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for lead generation, customer relationship management, and market intelligence; requires strong analytical skills and proficiency in multiple languages.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nProspecting, Lead generation, and new customer relationships establishment\nMarket and competitive intelligence\nIdentifying customer needs\nPresenting our company and its products to stimulate the interest of prospects for a Proof Of Concept demo\nExploitation of Vneruon CRM to log and update all activities\nCustomer Proposal Management\nWork closely with the Account Management team to convert detected opportunities into new customers"
    },
    {
      "url": "https://www.naukrigulf.com/english-speaker-lead-generation-specialist-jobs-in-tunisia-in-vneuron-1-to-3-years-n-cd-10009202-jid-230126501453",
      "title": "English Speaker Lead Generation Specialist",
      "company": "Vneuron",
      "experience": "1 - 3 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsibilities include data cleaning, lead sourcing, data enrichment, qualification, and collaboration with sales and marketing teams; requires analytical skills and excellent...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMissions / What you will do\nData Cleaning and Maintenance:\nRegularly review and clean CRM data to ensure accuracy and completeness.\nIdentify and rectify any inconsistencies or errors within the database\nLead Sourcing:\nUtilize various sources to identify and gather potential leads for different sectors and regions.\nImplement effective strategies to maximize lead generation efforts.\nData Enrichment:\nEnhance CRM data by gathering additional information relevant to leads, including industry trends, company news, and contact details.\nQualification:\nEvaluate lead quality and relevance to ensure alignment with our target audience.\nImplement lead scoring methods to prioritize high-potential leads.\nCollaboration:\nWork closely with the sales and marketing teams to align lead generation efforts with overall business objectives.\nProvide regular updates on lead generation metrics and performance."
    },
    {
      "url": "https://www.naukrigulf.com/systems-and-network-administrator-jobs-in-tunis-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126500106",
      "title": "Systems and Network Administrator",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Install, configure and deploy hardware, provide technical support, manage inventory, requiring strong analytical skills and knowledge of Linux and Windows environments.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nInstall, configure and deploy computer hardware and security equipment, assist users, resolve technical issues, manage IT purchases and monitor inventory to ensure smooth operation.\n\n\nAssignment :\nAssemble, install and commission new computer hardware and security equipment.\nProvide technical support to users.\nDiagnose and resolve equipment malfunctions.\nOrdering computer equipment.\nMonitor stock levels.\n\nRequired skills:\nLinux and Windows environments.\nGood knowledge of LAN networks.\nPassionate about new technologies.\nVersatile, rigorous and well organized\nAbility to work under pressure.\nAbility to manage emergencies.\n\nWhat do we propose?\nThe opportunity to work in stimulating environments and contribute to a positive impact on a global scale\nOpportunities for career advancement and development\nHealth and wellness benefits for you and your family\nA dynamic and pleasant environment, fostering the acquisition of new skills\nWorking conditions adapted to allow you to focus on what you love doing\nA high-performing team built on respect, sharing, and a passion for the profession\nEqual opportunities in employment, without distinction of gender, religion, culture or other\n\nNext step\nDo you have the audacity and the will to succeed? Don't wait any longer, come and contribute to your success and ours!\n\nFollow us on LinkedIn to learn more about our Spark team and our solutions."
    },
    {
      "url": "https://www.naukrigulf.com/senior-software-qa-engineer-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126500105",
      "title": "Senior Software QA Engineer",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for defining Quality Assurance processes, developing test plans, conducting test automation, and collaborating with teams to ensure quality software delivery.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nSoftware Quality testing is a necessity as we believe that it is the key to reach perfection. Your main mission will be to prove that our software is broken and to detect its failures and defects.\nYour will :\nDefine and drive the Quality Assurance processes using both manual and automated testing.\nDevelop software test plans and perform test validation scenarios\nDevelop and conduct test automation scripts\nLead the team on technical aspects and participate in its development\nIdentify, document and track anomalies and non-conformances\nReview technical specifications\nEnsure quality deliveries and respect of project requirements\nCollaborate with multidisciplinary teams : Product, r&d, BA, delivery\nEnsure a continuous improvement of our QA process\nProvide regular reports\nMake it work, make it right, make it fast.i> em> Kent Beck/em> /i>"
    },
    {
      "url": "https://www.naukrigulf.com/specialist-in-sales-prospecting-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500104",
      "title": "Specialist in Sales Prospecting",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsibilities include lead generation, client relationship building, and market monitoring; requires strong analytical skills and proficiency in French and English.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nProposed Missions\n\nProspecting, lead generation and establishing new relationships with clients.\nMonitoring the market and the competition.\nDetermine customer needs.\nPresenting our company and its products to stimulate the interest of prospects for a proof-of-concept demonstration.\nUsing Vneuron CRM to record and update all activities.\nManaging customer proposals.\nWorking closely with the account management team to convert identified opportunities into new clients.\n\n\nDesired profile\n\nA degree in French language, computer science, finance or a huge interest in these three fields.\nYou have strong analytical and problem-solving skills.\nYou have excellent interpersonal and communication skills.\nYou are dynamic and enterprising.\nAn excellent level of written and spoken French is imperative.\nA good level of English is appreciated.\nA good level in a third language (Spanish, Turkish, Portuguese).\nA strong interest and desire to progress in the commercial field.\nUnderstanding the sales process is an asset."
    },
    {
      "url": "https://www.naukrigulf.com/account-manager-jobs-in-tunisia-in-vneuron-5-to-10-years-n-cd-10009202-jid-230126500101",
      "title": "Account Manager",
      "company": "Vneuron",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Lead client relationships, drive sales cycles, and ensure customer nurturing with excellent negotiation skills and strong communication in English and French.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nLead impactful client relationships by identifying opportunities, shaping tailored solutions, driving the full sales cycle and closing strategic deals, while representing our company with excellence and delivering insightful reporting.\nVneuron is a fast-growing RegTech company helping financial institutions stay ahead of compliance and risk challenges. Our solution, Reis RCS, supports banks and financial services in fighting financial crime through advanced technology.\nIn 2025, Vneuron was named among the Top Innovators in the FinCrimeTech50 and won the Best Compliance as a Service Solution at the RegTech Insight Awards Europe. Weve also been recognized in the RegTech100 for the fourth year in a row on a global list of the most innovative companies in the field.\nIf you're looking to join a team thats making a real impact in the world of compliance and technology, Vneuron is the place to be.\nVneuron puts the development of its team at the heart of its priorities. We provide a pleasant and comfortable work environment. Our organizational structure is flat and collaborative, and our management is available and present.\nWe invite you to be part of a passionate and committed young team who values respect and sharing spirit. You will be surrounded by highly skilled technical and functional experts willing to guide you to evolve in all aspects of your career.\nWe believe that every person is unique and special. Thus, we provide attentive and active listening to your ideas and propositions as we believe that you will have an essential role in achieving our next milestone and shaping the future of Vneurons value proposition.\nWhat you will be doing\nProspect territories and Qualify Business opportunities\nParticipate in Business Development Strategies\nEnsure Customer Nurturing by developing good relationships with potential interlocutors\nParticipate in well responding to proposals with the collaboration of the presales team\nAnalyze prospects' and customers need\nRepresent our Company and products\nEnsure the coordination and supervision of the whole sale process\nEnsure financial negotiations and contracts conclusion\nPrepare regular reporting\nWhat do we offer?\nThe opportunity to work in exciting contexts and to help generate a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment that challenges you to develop new skills\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing, and Passion for what it does\nEqual Employment Opportunities no matter your gender, religious, culture, etc\nYour Next Steps\nIf you have the ambition to stimulate your career with new challenges while capitalizing on your potential and your perpetual thirst for learning, this job is for you.\nApply Now and become the next Spark!\nFollow us on LinkedIn to learn more about the Spark team and our Spark solutions.\nWe would be delighted to meet you and give you much more information!"
    },
    {
      "url": "https://www.naukrigulf.com/senior-accountant-jobs-in-tunisia-in-vneuron-3-to-5-years-n-cd-10009202-jid-230126500098",
      "title": "Senior Accountant",
      "company": "Vneuron",
      "experience": "3 - 5 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Manage general and analytical accounting, prepare monthly tax returns, ensure accounting consistency, and possess strong knowledge of Tunisian standards and payroll processes.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nTo manage general and analytical accounting , including the entry of accounting transactions of all kinds\nPrepare monthly tax and social security returns in compliance with regulatory deadlines.\nParticipate in the preparation of the monthly report\nPerform bank reconciliations\nEnsuring the consistency of accounting entries"
    },
    {
      "url": "https://www.naukrigulf.com/french-speaking-lead-generation-specialist-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500096",
      "title": "French-speaking Lead Generation Specialist",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "The role involves data cleaning, lead generation, and collaboration with sales teams, requiring strong analytical skills and excellent written French.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nVneuron prioritizes the development of its employees and enables its teams to work in optimal conditions.\nWe invite you to join a young, passionate team driven by a taste for challenge. We also uphold the values of respect , commitment , and growth .\nWe believe that each person is unique and special. Therefore, we listen carefully and actively to your ideas and suggestions because we believe you will play a vital role in the realization of our next step.\nYou will also be surrounded by technical and functional experts to help you progress in your professional career.\nTo strengthen our global presence, we are looking for a Lead Generation Specialist based in Tunisia.\nMissions, Proposals\nData cleaning and updating:\nRegularly review and clean CRM data to ensure accuracy and completeness.\nIdentify and correct any inconsistencies or errors in the database.\nMain supply:\nUse various sources to identify and gather potential leads for different sectors and regions.\nImplement effective strategies to maximize lead generation efforts.\nData enrichment:\nEnhance CRM data by collecting additional information relevant to prospects, including industry trends, company news, and contact information.\nQualification :\nevaluate the quality and relevance of the leads to ensure their alignment with our target audience.\nImplement prospect scoring methods to prioritize high-potential prospects.\nCollaboration :\nWorking closely with the sales and marketing teams to align lead generation efforts with overall business objectives.\nProvide regular updates on lead generation metrics and performance."
    },
    {
      "url": "https://www.naukrigulf.com/senior-customer-solutions-consultant-presales-engineer-jobs-in-tunis-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500095",
      "title": "Senior Customer Solutions Consultant / Presales Engineer",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Support sales productivity by qualifying leads, analyzing needs, preparing presentations, and collaborating with teams; requires IT background and strong communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nThe Customer Solution Consultant supports sales productivity and deal flow by securing the technical win. He collaborates with sales, support, product, and development teams in order to propose the best-suited deals for potential prospects.\n\nMissions :\nQualify potential leads and sales opportunities.\nInvestigate and analyze prospects' needs.\nElaborate commercial propositions including technical and functional aspects.\nCollaborate with multidisciplinary teams to reach the needed information.\nPrepare high-quality Proof of Concept (POC) presentations for potential prospects demonstrating how we can satisfy their need and convince them with Vneurons solution.\nEnsure negotiations and Q/A sessions\nDrive market and competitive intelligence\n\nRequired profile :\nIT background\nSignificant experience in Pre-Sales position\nExcellent analytical and problem-solving skills\nExcellent interpersonal and communication skills\nDynamic, self-starter, curious and empathetic\nGood written and verbal English level\nGood written and verbal French level\nSharp, clear, and structured communicator\n\nNice to have:\nEngineering degree\nExperience in IT sales\nKnowledge in the Risk & Compliance field\n\n\n\nBenefits\nThe opportunity to work in exciting contexts and to help generate a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment that challenges you to develop new skills\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing and Passion for what it does\nEqual Employment Opportunities no matter your gender, religion, culture, etc.\n\n\n\n\nNext steps\n\nIf you have the ambition to stimulate your career with new challenges while capitalizing on your potential and your perpetual thirst for learning, this job is for you.\n\nApply Now and become the next Spark!\n\nFollow us on LinkedIn to learn more about the Spark team and our Spark solutions.\nWe would be thrilled to meet you and give you much more information!"
    },
    {
      "url": "https://www.naukrigulf.com/risk-compliance-and-legal-officer-jobs-in-tunisia-in-vneuron-5-to-10-years-n-cd-10009202-jid-230126500094",
      "title": "Risk, Compliance and Legal Officer",
      "company": "Vneuron",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for identifying compliance risks, preparing regulatory reports, and drafting agreements; requires a Master's degree and strong analytical skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n1. Operational Tasks - RCCI\nIdentifying compliance risks\nUpdating the risk map\nWriting, analyzing, and enhancing the effectiveness and relevance of existing tools\nImplementing and executing the ongoing control strategy\nRegulatory monitoring: identifying national regulatory developments and international recommendations that could affect the company's operations\nTracking incidents and complaints\nManaging relationships with regulatory authorities\nPromoting ethical conduct\nEstablishing effective compliance programs\n2. Reporting\nPreparation of regulatory reports\nDevelopment of periodic activity reports, reporting, and documentation for our clients\nParticipation in committees/meetings\n3. Contractual aspects\nDrafting and updating product sales agreements with various partner institutions.\nMonitoring customer relationships.\nAssist in contract negotiations to achieve favorable terms and conditions.\nProvide guidance and support to internal stakeholders during the negotiation process."
    },
    {
      "url": "https://www.naukrigulf.com/account-delivery-manager-with-italian-jobs-in-tunisia-in-hewlett-packard-5-to-7-years-n-cd-10001411-jid-160226500983",
      "title": "Account Delivery Manager with Italian",
      "company": "Hewlett-Packard",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "16 hrs ago",
      "description_preview": "Manage on-site software service delivery, ensuring customer satisfaction through technical support, relationship building, and proactive problem-solving while leveraging advance...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nJob Family Definition:\nWithin the family there is a range of technical and managerial customer on-site functions. The family of jobs is focused on managing the onsite delivering of software services, pre-sales, post-sales or service delivery support, installation and configuration for customer environments. The jobs solve various business systems, networking and applications problems for standard industry servers, specialized or complex clustered environments. Deliver reactive and proactive activities according to Service Level Agreement to ensure customer satisfaction and loyalty. Provides direct post-sales systems on site technical support for reactive and proactive customers. Each position maintains a high level of customer satisfaction by ensuring clear business and technical solution alignment, clarifying customer needs and ensuring that they are met. Jobs are responsible for company Total Customer Experience as well as the revenue growth, profitability, and account retention.\nManagement Level Definition:\nApplies developed subject matter knowledge to solve common and complex business issues and recommends appropriate alternatives. Works on problems of diverse complexity and scope. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision making process. Exercises independent judgment to identify and select a solution. Ability to handle most unique situations. May seek advice in order to make decisions on complex business issues.\nResponsibilities:\nApply advanced technical knowledge to operate one or more technology areas (e.g. server administration, technical security management, performance management) or customer groups that are critical or high- risk.\nIntegrate technical knowledge and business understanding to create. solutions for customers.\nResolve single- and cross- technology incidents independently. Work with team members to resolve unusually complex or cross- technology incidents.\nProactively and reactively look for solutions to prevent problems from occurring in team/technology area.\nApply company solutions to meet highly complex customer needs.\nIdentify additional services that could lead to future service revenue growth.\nProvide technical consulting during contract renewal discussions.\nBuild and maintain strong relationship up to senior management level in assigned accounts.\nDesign and deliver support solutions using specific industry knowledge and expertise.\nAssist in managing delivery of industry support solutions.\nLead Customer Expectation management as part of escalation process.\nLead cross-team or large programs/projects.\nCoach or guide junior consultants.\nKnowledge and Skills:\nThorough knowledge of company products and services offerings, company organization, competition, third party products and market trends.\nBroad knowledge of corporate organization, job, and policies.\nComprehensive business, technical or functional knowledge at an expert level.\nCommunicate tactfully with diplomacy up to senior management levels within an organization.\nActive listening skills and ability to adjust messages to audience level.\nProblem-solving skills (proactive, reactive and creative).\nAble to employ exemplary consulting skills by becoming a trusted advisor to the customer and providing clarity to solution determination.\nWell versed in core technical competencies and peaked in some technical area(s) intermediate skills in project management, communication, analysis and presentation.\nProvide suggestions for operational efficiencies."
    },
    {
      "url": "https://www.naukrigulf.com/account-support-manager-with-italian-jobs-in-tunisia-in-hewlett-packard-5-to-10-years-n-cd-10001411-jid-160226500982",
      "title": "Account Support Manager with Italian",
      "company": "Hewlett-Packard",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "16 hrs ago",
      "description_preview": "Manage customer support and technical solutions, ensuring satisfaction and account retention while possessing advanced technical knowledge and fluency in Italian.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nJob Family Definition:\nWithin the family there is a range of technical and managerial customer on-site functions. The family of jobs is focused on managing the onsite delivering of software services, pre-sales, post-sales or service delivery support, installation and configuration for customer environments. The jobs solve various business systems, networking and applications problems for standard industry servers, specialized or complex clustered environments. Deliver reactive and proactive activities according to Service Level Agreement to ensure customer satisfaction and loyalty. Provides direct post-sales systems on site technical support for reactive and proactive customers. Each position maintains a high level of customer satisfaction by ensuring clear business and technical solution alignment, clarifying customer needs and ensuring that they are met. Jobs are responsible for company Total Customer Experience as well as the revenue growth, profitability, and account retention.\nManagement Level Definition:\nApplies developed subject matter knowledge to solve common and complex business issues and recommends appropriate alternatives. Works on problems of diverse complexity and scope. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision making process. Exercises independent judgment to identify and select a solution. Ability to handle most unique situations. May seek advice in order to make decisions on complex business issues.\nResponsibilities:\nApply advanced technical knowledge to operate one or more technology areas (e.g. server administration, technical security management, performance management) or customer groups that are critical or high- risk.\nIntegrate technical knowledge and business understanding to create. solutions for customers.\nResolve single- and cross- technology incidents independently. Work with team members to resolve unusually complex or cross- technology incidents.\nProactively and reactively look for solutions to prevent problems from occurring in team/technology area.\nApply company solutions to meet highly complex customer needs.\nIdentify additional services that could lead to future service revenue growth.\nProvide technical consulting during contract renewal discussions.\nBuild and maintain strong relationship up to senior management level in assigned accounts.\nDesign and deliver support solutions using specific industry knowledge and expertise.\nAssist in managing delivery of industry support solutions.\nLead Customer Expectation management as part of escalation process.\nLead cross-team or large programs/projects.\nCoach or guide junior consultants.\nEducation and Experience Required:\nBachelor's degree preferred or Associate degree holder (technical field) with 5- 7 years working experience in related fields desired.\nKnowledge and Skills:\nThorough knowledge of company products and services offerings, company organization, competition, third party products and market trends.\nBroad knowledge of corporate organization, job, and policies.\nComprehensive business, technical or functional knowledge at an expert level.\nCommunicate tactfully with diplomacy up to senior management levels within an organization.\nActive listening skills and ability to adjust messages to audience level.\nProblem-solving skills (proactive, reactive and creative).\nAble to employ exemplary consulting skills by becoming a trusted advisor to the customer and providing clarity to solution determination.\nWell versed in core technical competencies and peaked in some technical area(s) intermediate skills in project management, communication, analysis and presentation.\nProvide suggestions for operational efficiencies."
    },
    {
      "url": "https://www.naukrigulf.com/business-operations-lead-tunis-hub-jobs-in-tunisia-in-hewlett-packard-8-to-13-years-n-cd-10001411-jid-110226500800",
      "title": "Business Operations Lead Tunis HUB",
      "company": "Hewlett-Packard",
      "experience": "8 - 13 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "11 Feb",
      "description_preview": "Lead operational excellence and transformation initiatives, driving governance, performance management, and innovation to optimize customer experience and organizational perform...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nWe are looking for Business Operations Lead Tunis HUB to join our team!\nLead and orchestrate operational excellence for the Global Technical Support Tunis HUB and Geos by driving governance, performance management, and transformation initiatives. Act as the strategic enabler and single point of accountability for operational processes, ensuring alignment with corporate objectives and bold goals. Deliver executive-level business reviews, foster collaboration across hubs, and champion innovation through automation, analytics, and continuous improvement to optimize customer experience and organizational performance.\nHow you will make your mark:\nOperational Excellence & Governance\nDeploy and measure Objectives and Key Results (OKRs) aligned with Business bold goals.\nDefine and track KPIs across Global Technical Support.\nDrive performance reviews and ensure alignment with organizational goals.\nLead operational excellence through standardization, simplification, and automation of business processes.\nOwn HUB governance and policies, ensuring compliance and driving metrics leadership.\nEnable end-to-end customer experience through analytics, insights, and dashboards.\nStandardize processes, enforce compliance, and mitigate risks.\nCollaborate with Ops Leads, SME s and hubs globally to ensure operational excellence.\nPrepare and deliver Quarterly Business Reviews (QBRs) and organizational performance reports for senior leadership.\nConsolidate insights into clear, actionable narratives for executive decision-making.\nStrategy, Planning & Transformation\nDrive internal transformation projects across the organization.\nDrive cost optimization and ROI tracking for transformation projects.\nDrive financial discipline across the organization.\nBuild and lead current and future Cap-Cap models.\nEnsure timely delivery of milestones and adoption of new processes.\nOwn and deploy the Organization s Plan of Record (PoR).\nContribute to strategic planning and governance frameworks that optimize operational performance.\nAlign resource planning with business priorities.\nAlign operational priorities with corporate objectives and transformation roadmaps.\nServe as the bridge between business strategy and execution, ensuring operational readiness for growth initiatives.\nPromote collaboration across HPE Operations and hubs.\nInnovation & Continuous Improvement\nChampion innovation and automation initiatives to modernize operations.\nIncubate ideas for process automation, AI-driven analytics, and digital transformation.\nIdentify opportunities for process optimization and digital transformation.\nDrive operational maturity assessments and benchmark against industry best practices."
    },
    {
      "url": "https://www.naukrigulf.com/salesforce-business-analyst-jobs-in-tunis-tunisia-in-questel-2-to-6-years-n-cd-40001777-jid-090226500561",
      "title": "Salesforce Business Analyst",
      "company": "Questel",
      "experience": "2 - 6 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "9 Feb",
      "description_preview": "The role involves analyzing business needs, documenting requirements, conducting testing, and improving Salesforce processes while collaborating with stakeholders and teams.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40001777/40001777_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nPosition Overview:\nThe Salesforce Business Analyst is responsible for analyzing, translating, and documenting business needs to support the implementation and optimization of Salesforce-based platforms, including Equinox Corporate+ and Equinox Invention. Acting as a bridge between business and technology, this role ensures that functional requirements are clearly defined, and solutions are delivered to meet end-user expectations.\nPrincipal Duties & Responsibilities:\n\nCollaborate with internal stakeholders and Solution Engineers to gather, analyze, and document functional requirements\n\nTranslate business needs into user stories and define acceptance criteria for development and testing\n\nOrganize and lead functional testing campaigns and user acceptance testing (UAT) in sandbox and Trials environments\n\nCoordinate with Salesforce administrators and developers on deployment activities, including Change Sets, Salesforce CLI, and Git workflows\n\nValidate successful implementation of new features, proactively monitor actions, and resolve any post-deployment issues\n\nIdentify opportunities for continuous improvement of Salesforce business processes and platform usability\n\nMaintain user documentation and functional documentation and user guides to promote the adoption of implemented solutions\n\nParticipate in Agile ceremonies and ensure alignment between solutions and business priorities\n\nStay current on Salesforce platform developments and assess potential impact on current systems\n\nCollaborate with cross-functional teams and R&D teams supporting the Orbit Invention platforms to support functional evolution and optimization\n\nWork on special projects and other duties as assigned by management\n\nQualifications & Skills:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential function.\nEducation and Experience: Bachelor s degree in Business Administration, Information Systems, Computer Science, or a related field preferred; or any combination of education, experience and training which provides the following knowledge, skills and abilities:\n\nMinimum 2 years of experience in Salesforce functional analysis and implementation required\n\nSalesforce Business Analyst Certification preferred\n\nProficient in Salesforce native tools such as Flows, Validation Rules, and Custom Objects\n\nUnderstanding of APEX and SOQL\n\nFamiliar with Salesforce Sandbox Management, Change Sets, Salesforce CLI, and Git\n\nExperience using tools such as JIRA, Confluence, and working within Agile/Scrum frameworks\n\nStrong analytical, organizational, and documentation skills\n\nExcellent verbal and written communication in English\n\nSelf-starter with the ability to work independently and collaboratively across teams\n\nEffective at managing multiple priorities in a fast-paced, global environment\n\nAdaptable, solutions-oriented and proactive in identifying improvements\n\nThis job description may evolve based on business needs."
    },
    {
      "url": "https://www.naukrigulf.com/marketing-intern-mea-jobs-in-tunis-tunisia-in-sbs-software-1-to-2-years-n-cd-40003719-jid-090226500021",
      "title": "Marketing Intern MEA",
      "company": "SBS Software",
      "experience": "1 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "9 Feb",
      "description_preview": "Assist in implementing marketing plans, organizing events, coordinating with teams, and analyzing campaign performance; requires strong organizational skills and fluency in Fren...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40003719/40003719_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\nJob Description\nOur international and collaborative marketing team designs and implements digital campaigns, events, go-to-market strategies, and communication programs that enhance the global visibility of the SBS brand. As a marketing intern for the MEA region , you will work closely with the sales and marketing teams to develop and implement local initiatives that directly support business growth.\nYour tasks\nContribute to the implementation of the operational marketing plan for the MEA region.\nHelping with event organization.\nEnsure coordination with agencies, suppliers and service providers to guarantee quality and adherence to deadlines.\nEnsure the monitoring of local campaigns (emails, content, sales materials, localized social networks).\nMonitor and analyze the performance of field activities (reports, measurement of return on investment, recommendations).\nEnsure continuous monitoring of key achievements in the region (new contracts, strategic signings, go lives, business milestones).\nCoordinate with local teams (sales, delivery, management) to collect, qualify and validate information.\nQualifications\nCurrently enrolled in a bachelor's or master's degree (M1/M2) in marketing, business, communication or a related field.\nStrong organizational skills, attention to detail and a proactive mindset.\nExcellent interpersonal and writing skills.\nProficient in PowerPoint and Excel; experience with CRM or marketing automation tools is a plus.\nFluency in French and English is required."
    },
    {
      "url": "https://www.naukrigulf.com/release-manager-jobs-in-tunis-tunisia-in-neoxam-tunisie-3-to-8-years-n-cd-40001082-jid-030226501119",
      "title": "Release Manager",
      "company": "NeoXam Tunisie",
      "experience": "3 - 8 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "3 Feb",
      "description_preview": "Responsible for planning and managing software releases, ensuring quality and coordination among teams, with expertise in SDLC, Agile, and CI/CD.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40001082/40001082_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAs part of NeoXam s R&D department, the Release Manager is responsible for planning, coordinating, and managing DataHub software releases across multiple environments and projects. This role ensures smooth deployment of new features, enhancements, and fixes by aligning development, testing, and business teams. The Release Manager oversees the end-to-end release lifecycle from planning and build integration to testing, deployment, and post-release validation ensuring minimal disruption and maximum quality.\nMISSION\nRelease Planning & Governance\nDefine, document, and manage the overall release calendar across multiple stakeholders.\nCollaborate with product owners, development leads, and the QA team to identify release scope and dependencies.\nEstablish and maintain release governance standards, policies, and processes.\nCoordination & Communication\nAct as the central point of contact for all release-related activities and communications.\nFacilitate release readiness reviews, go/no-go meetings, and post-release retrospectives.\nCommunicate release scope, milestones, and risks to all stakeholders.\nRelease Execution & Deployment\nCoordinate build deployments and ensure version control, tagging, and release documentation are properly maintained.\nManage deployment pipelines (CI/CD) in collaboration with DevOps and Infrastructure teams.\nEnsure rollback, recovery, and contingency procedures are in place and tested.\nQuality & Risk Management\nMonitor release quality by aligning with QA team on testing outcomes and defect tracking.\nIdentify potential risks and conflicts early in the release cycle and drive mitigation strategies.\nTrack release metrics (success rate, failure rate, deployment time, etc.) to improve future performance.\nAutomation & Continuous Improvement\nPartner with DevOps to streamline and automate release processes where feasible.\nContinuously review and enhance release processes for efficiency, predictability, and scalability.\nPROFILE\nStrong understanding of SDLC, Agile, DevOps, and CI/CD principles.\nExcellent organizational and stakeholder management skills.\nHands-on experience with release tools such as Jira, Git, Bitbucket, Jenkins, Artifactory, good to have Azure DevOps, or GitLab CI/CD.\nProven experience managing releases across multiple environments and teams (DEV, QA, UAT, PROD).\nStrong analytical and problem-solving abilities.\nProven ability to work under pressure and manage multiple concurrent releases.\nIt s even better if you have :\nExperience in regulated industries (finance, healthcare, etc.) with controlled release processes.\nPMO, Agile/Scrum or ITIL certification(s)\nFamiliarity with cloud environments (AWS, Azure, GCP).\nWe are looking for a highly rigorous and persistent professional with excellent communication skills and the ability to drive and promote best practices across teams.\nYou will also bring a continuous improvement mindset and strong capabilities in risk management and issue resolution to support the team s performance and long-term success.\nWHAT WE OFFER\nA permanent contract (CDI).\nA pleasant and collaborative work environment, where team spirit is key.\nAn attractive compensation package, including a fixed salary, performance bonus, meal vouchers, health and life insurance.\nA flexible and hybrid work model, combining remote work and on-site presence.\nAnd much more..."
    },
    {
      "url": "https://www.naukrigulf.com/junior-devops-engineer-jobs-in-tunisia-in-think-tank-business-solutions-ag-1-to-3-years-n-cd-40002442-jid-290126501720",
      "title": "Junior DevOps Engineer",
      "company": "think tank Business Solutions AG",
      "experience": "1 - 3 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "29 Jan",
      "description_preview": "Responsible for developing cloud computing solutions, performing application maintenance, and utilizing DevOps tools with strong programming and communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40002442/40002442_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nResponsibilities:\nResponsible for working with development teams to translate scalability, performance, reliability, and functional requirements to virtualized/cloud computing solutions with strong capacity in the management of cloud computing clusters.\nYou will be responsible for routine application maintenance tasks, create requirements and procedures for implementing routine maintenance and troubleshooting existing information systems for errors, and resolving errors\nYou will be responsible for developing and building IT solutions and installing and configure solutions, implement reusable components, translate technical requirements, assist with all stages of test data, develop interface stubs and simulators, and perform script maintenance and updates,\nParticipate in the processes of strategic project-planning meetings and providing guidance and expertise on system options,\nQualifications:\nKnowledge of best practices in support of IT operations and a good understanding of programming languages, including Java, br>\nHands-on experience with configuration and use of DevOps tools and software process automation with popular scripting languages (Perl, python, ruby, shell, javascript ..).br>\nProficiency in Cloud Services: Amazon web services. Microsoft Cloud Azure, Google Cloud, ../\nGood understanding of System Administration: Monitoring Tools, Networking concepts, Backups.br>\nGood experience in terms of build, release, and configuration management in a CI/CD environment (version control, CM, ).br>\nAbility to work with containerization platforms such as Kubernetes, Docker; cloud provisioning software, including Ansible, br>\nProvide high performance cloud deployment solutions and maintain rapid deployment pipelines,br>\nCurrent understanding of best practices regarding system security measures.br>\nStrong written communications skills are necessary for writing clear and concise documentation also as well as verbal communication skills to relate with team members, clients, and others in a workplace./p>"
    },
    {
      "url": "https://www.naukrigulf.com/l1-storage-support-engineer-with-spanish-jobs-in-tunisia-in-hewlett-packard-0-to-1-year-n-cd-10001411-jid-270126503033",
      "title": "L1 Storage Support Engineer with Spanish",
      "company": "Hewlett-Packard",
      "experience": "0 - 1 Year",
      "location": "Tunisia - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "Provide technical support for hardware and software issues, ensuring customer satisfaction and effective communication in Spanish while resolving problems.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\n\nJob Description:\nWe are looking for L1 Support Engineer with Spanish language to join our team!\nHow you ll make your mark:\nSuccessfully resolve technical issues (hardware and software) from incoming internal or external businesses and end user's contacts and proactive notification systems.\nRespond to service, product, technical, and customer- relations questions on subjects such as features, specifications, and repairs on current and discontinued products, parts, and options, based on customer entitlement (warranty through mission-critical). .\nResolve incoming internal or external businesses and end user's problems via telephone and e-support.\nArticulate both in writing and verbally case summary, resolution and add to Knowledge Management System (KMS).\nProactively assist customers to avoid or reduce problem occurrence.\nRepresent the company in a face to face customer location visit, industry conference/trade show, vendor meeting, etc.\nEngage team members for support as required to ensure internal or external business and end user SLA demands are met.\nBegin to partner with and assist the Sales Pursuit team.\nAbout you:\n0-1 year experience in relevant technologies and customer environments.\nRelevant industry qualification where applicable\nExcellent verbal and written communication skills in language to be supported.\nExperience in troubleshooting in a technical environment.\nExcellent analytical and problem solving skills.\nSoftware and hardware knowledge of computing, storage and peripheral devices.\nAdvanced proficiency with case management databases and tools.\nSuperior customer service skills.\nPhone and remote support experience. E-support experience.\nFluent Spanish language\n\n\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have whether you want to become a knowledge expert in your field or apply your skills to another division.\nUnconditional Inclusion\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know varied backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    },
    {
      "url": "https://www.naukrigulf.com/l1-storage-support-engineer-italian-jobs-in-tunisia-in-hewlett-packard-0-to-1-year-n-cd-10001411-jid-270126500900",
      "title": "L1 Storage Support Engineer Italian",
      "company": "Hewlett-Packard",
      "experience": "0 - 1 Year",
      "location": "Tunisia - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "The role involves resolving technical issues, providing customer support, and requires excellent communication skills in English and Italian.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\nJob Description:\nWe are looking for L1 Storage Support Engineer with Italian language to join our team!\nHow you ll make your mark:\nSuccessfully resolve technical issues (hardware and software) from incoming internal or external businesses and end user's contacts and proactive notification systems.\nRespond to service, product, technical, and customer- relations questions on subjects such as features, specifications, and repairs on current and discontinued products, parts, and options, based on customer entitlement (warranty through mission-critical). .\nResolve incoming internal or external businesses and end user's problems via telephone and e-support.\nArticulate both in writing and verbally case summary, resolution and add to Knowledge Management System (KMS).\nProactively assist customers to avoid or reduce problem occurrence.\nRepresent the company in a face to face customer location visit, industry conference/trade show, vendor meeting, etc.\nEngage team members for support as required to ensure internal or external business and end user SLA demands are met.\nBegin to partner with and assist the Sales Pursuit team.\nAbout you:\n0-1 year experience in relevant technologies and customer environments.\nRelevant industry qualification where applicable\nExcellent verbal and written communication skills in language to be supported.\nExperience in troubleshooting in a technical environment.\nExcellent analytical and problem solving skills.\nSoftware and hardware knowledge of computing, storage and peripheral devices.\nAdvanced proficiency with case management databases and tools.\nSuperior customer service skills.\nPhone and remote support experience. E-support experience.\nFluent English and Italian languages\nAdditional Skills:\nAccountability, Accountability, Action Planning, Active Learning, Active Listening, Bias, Business Growth, Business Planning, Coaching, Commercial Acumen, Creativity, Critical Thinking, Cross-Functional Teamwork, Customer Experience Strategy, Customer Solutions, Data Analysis Management, Data Collection Management (Inactive), Data Controls, Design Thinking, Empathy, Follow-Through, Growth Mindset, Intellectual Curiosity (Inactive), Long Term Planning, Managing Ambiguity {+ 5 more}\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have whether you want to become a knowledge expert in your field or apply your skills to another division.\nUnconditional Inclusion\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know varied backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    },
    {
      "url": "https://www.naukrigulf.com/software-integration-consultant-jobs-in-tunis-tunisia-in-vneuron-3-to-5-years-n-cd-10009202-jid-270126500137",
      "title": "Software Integration Consultant",
      "company": "Vneuron",
      "experience": "3 - 5 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "Implement software integrations, analyze requirements, configure solutions, and document technical implementations while possessing strong analytical and communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nImplement seamless software integrations,analyze requirements, draft specs, configure and develop solutions, connect REIS with client systems, model business rules, support deployment and document technical implementations.\n\n\nAbout Vneuron and Reis RCS\nVneuron is a fast-growing RegTech company helping financial institutions stay ahead of compliance and risk challenges. Our solution, Reis RCS , supports banks and financial services in fighting financial crime through advanced technology.\nIn 2025, Vneuron was named among the Top Innovators in the FinCrimeTech50 and won the Best Compliance as a Service Solution at the RegTech Insight Awards Europe. Weve also been recognized in the RegTech100 for the fourth year in a row a global list of the most innovative companies in the field.\nIf youre looking to join a team thats making a real impact in the world of compliance and technology, Vneuron is the place to be.\n\nOur Culture & Values\nVneuron puts the development of its team at the heart of its priorities. We provide a pleasant and comfortable work environment. Our organization is collaborative and flat-structured. And, our management is available and present.\nMoreover, We have a passionate and committed young team who values respect and sharing spirit. You will be surrounded by highly skilled experts willing to guide you to evolve in all aspects of your career. We aim to spread our innovative technology worldwide, so we can take part in generating a positive impact.\nWe believe that every person is unique and special. Thus, we provide attentive and active listening to your ideas and propositions as we believe that you will have an essential role in achieving our next milestone.\n\nWhy would you love to join us?\nChallenging context to expand your technical and professional skills\nOpportunity to start a promising career\nPleasant and comfortable work environment (Relaxation and play areas)\nWork along with our passionate and brilliant Spark team\nHighly qualified mentor to guide you through the realization of your project\nBeing surrounded by Highly skilled experts in different fields such as Software Architecture, Software Release Management, Software Quality Assurance, Project Management, Consulting, Selling, etc.\nEqual opportunity no matter your gender, religion, culture, color, etc.\n\nResponsibilities:\nAnalyze project requirements while considering the functionalities of the REIS suite.\nContribute to the drafting of technical specification documents.\nPerform configurations and developments required for the implementation of technical and functional requirements.\nIntegrate and implement interfacing mechanisms between the REIS suite and the clients information system.\nModel business rules and implement them in the REIS platform, following best practices.\nEstimate the workload needed to complete the technical part of the project.\nProvide support during the deployment and acceptance testing phases in the clients environment.\nWrite documentation for the implemented technical solutions.\n\nProfile:\nHaving a degree in Computer Science, ideally with a component in Business Management.\nHaving strong analytical skills, allowing for effective modeling and optimal implementation of business needs.\nDemonstrating rigor, method, and a solution-oriented mindset.\nPossessing excellent communication abilities and ease in collaborative environments.\nBeing adaptable and able to perform well under pressure.\nGood knowledge of JavaScript, Postman, Form.io, Freemarker, UML/BPMN, GitLab, SQL, and PostgreSQL.\nGood mastery of data integration mechanisms and tools such as Talend/ETL and Spring Integration.\nProficient in Microsoft Office tools.\n\nBenefits :\nThe opportunity to work on exciting projects that are generating a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment where diversity is applauded, and success is celebrated.\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing and Passion for what it does\nEqual Employment Opportunities : Gender, religious, culture equity\nPossibility to work remotely"
    },
    {
      "url": "https://www.naukrigulf.com/revenue-management-assistant-part-time-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501483",
      "title": "Revenue Management Assistant - Part-time",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Support revenue analysis, monitor key performance indicators, improve billing processes, and validate records; requires finance knowledge and proficiency in Excel.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nSupport revenue analysis and financial reporting.\nMonitor key performance indicators (MRR, TTM, churn rate, etc.).\nAssist in improving billing and collection processes.\nHelp prepare management presentations and reports.\nSupport revenue assurance by validating records against contracts.\n\nMain Responsibilities:\nSupport revenue analysis and financial reporting.\nMonitor key performance indicators (MRR, TTM, churn rate, etc.).\nAssist in improving billing and collection processes.\nHelp prepare management presentations and reports.\nSupport revenue assurance by validating records against contracts."
    },
    {
      "url": "https://www.naukrigulf.com/it-support-engineer-integration-specialist-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501481",
      "title": "IT Support Engineer - Integration Specialist",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Provide personalized IT support, troubleshoot incidents, develop customer relationships, and collaborate on knowledge base enhancement using various technologies.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nApply organizations processes to provide efficient, personalized support for both Tunisian and foreign clients.\nMonitor, troubleshoot and resolve application incidents reported by the client with respect of fixed SLA and deadlines.\nPrioritize and categorize incidents.\nTrack and document issues and resolutions.\nTroubleshoot issues by using the organizations knowledge base and other resources available.\nCollaborate in developing and enriching the organization knowledge base.\nGenerate necessary reports required by the IT department and/or the client.\nHandle escalation and coordination with R&D engineers.\nHandle communication with clients and other support levels.\nHandle new features development and configuration using the system tools and based on client change requests."
    },
    {
      "url": "https://www.naukrigulf.com/revenue-management-analyst-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501479",
      "title": "Revenue Management Analyst",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Monitor and analyze revenue performance, support forecasting models, collaborate with teams, and produce reports; requires strong analytical skills and proficiency in Excel.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMonitor, analyze, and drive revenue performance (MRR, TTM, churn, upsell/cross-sell).\nSupport the design and improvement of forecasting models.\nCollaborate with sales, finance, and product teams to optimize performance.\nProduce regular reports and ad hoc analyses for management.\nInspect ERP data for errors and recommend corrective actions.\nEnsure revenue accuracy by validating financials against contracts.\nPerform variance analysis and provide insights for management.\nContribute to the continuous improvement of revenue management processes."
    },
    {
      "url": "https://www.naukrigulf.com/head-of-r-d-engineering-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501476",
      "title": "Head of R&D Engineering",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Collaborate with the Chief Technology Officer to shape product strategy, lead engineering teams, and develop software using JAVA frameworks and agile methodologies.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nWork along with the CTO to set the roadmap and ensure its proper implementation\nParticipate in shaping product strategy and making technical decisions\nArchitect and develop new functionalities\nCoach and lead technically our engineering team\nEvaluate and improve the performance, maintainability, and security of applications in production.\nWork in an agile environment\nParticipate in team development\nLeading, planning and budgeting projects\nWhat You Wont Be Doing\nYou will not be making any decisions based primarily on saving money.\nYou will not participate in pointless or ineffective meetings. So we give you the time and resources to live your passion.\nYou will not be talking to customers.\nYou will definitely not receive demands from people who dont understand the trade.\nRequired profile\nSignificant experience in the field of software\nSignificant experience with JAVA frameworks (Spring, Hibernate) and Frontendbr>\ntechnologies (Angular, Typescript).\nKnowledge of Elasticsearch and Postgresql technologies\nSolid foundation in computer science, with strong competencies in algorithms, data structures, software design, and building large, distributed systems.\nA good technical curiosity to ensure permanent watch of the most recentbr>\ntechnologies.\nProactive and having a problem-solving mindset\nA good experience in engineering leadership roles\nAbility to guide team members towards optimal problem solving\nAbility to work in an agile environment\nVery good at explaining why and how"
    },
    {
      "url": "https://www.naukrigulf.com/java-technical-lead-jobs-in-tunis-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501475",
      "title": "Java Technical Lead",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Lead and supervise a team in Java development, ensuring code quality, guiding junior developers, and participating in technology choices and software design.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nLead and Supervise technically your team\nGuide your Team through technical issues and challenges\nParticipate in technological choices, design and development of Vneurons products and projects.\nEnsure good code quality and respect the best practices of modern coding\nDevelop work schedules and establish the load and time estimates\nDevelop new software functionalities\nkeep up to date with industry trends\nBring the fruits of your experience to improve the collective effectiveness of the team\nContribute to the recruitment of young developers"
    },
    {
      "url": "https://www.naukrigulf.com/software-business-analyst-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501473",
      "title": "Software Business Analyst",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Analyze customer needs, define solutions, prepare specifications, coordinate teams, and train users, requiring strong communication and analytical skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAnalyze needs, shape solutions, gather and define requirements, lead business discussions, prepare functional specs, align R&D, QA and delivery, coordinate teams and train end-users to ensure smooth adoption and customer satisfaction.\nYou will have the opportunity to work on exciting projects that are generating a positive impact around the world. We believe that every person is unique and special. Thus, we provide an attentive and active listening to your ideas and propositions as we believe that you will have an essential role in shaping the future of Vneuron's value proposition.\nWhat you will be doing ?\nIdentify and collect customers requirements\nConduct business meetings to analyze and frame customers need\nConceive and define the optimal solution for customer need\nPrepare detailed functionnal specifications of the project\nEnsure clear understanding of customers requirements by r&d, QA, and delivery teams\nCoordinate with multidisciplinary teams to ensure customer satisfaction\nEnsure workshops to train final user about our software"
    },
    {
      "url": "https://www.naukrigulf.com/solution-architect-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501470",
      "title": "Solution Architect",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Design solutions and roadmaps, debug issues, document best practices, and communicate with stakeholders; requires software engineering diploma and expertise in JAVA frameworks a...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nDesigning and recommending solutions along with roadmaps for proposed implementations.\nDebugging issues and generating performance analyses for deployed solutions.\nDocumenting and sharing best practices while advocating for process improvements.\nCommunicating with teams, clients, and project stakeholders while providing technical oversight at all project stages."
    },
    {
      "url": "https://www.naukrigulf.com/accounting-assistant-jobs-in-tunis-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126501465",
      "title": "Accounting Assistant",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Manage accounts payable, payroll, and expense reports while ensuring compliance; requires a degree in accounting and strong computer skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nEnsure accounts payable, invoice and expense entry, prepare social and tax declarations, manage payroll, leave and expense reports, while guaranteeing compliance and efficiency in a dynamic environment.\nManage accounts payable, including the entry of purchase invoices, overhead costs and fixed assets.\nClassifying and sorting accounting documents\nPrepare social and tax declarations\nTrack and record expense reports.\nManage leave and monitor absences (schedules, absences, paid leave)\nManage payroll and all administrative aspects (preparation, data entry, calculation, verification)\nConfigure the payroll tool and monitor regulatory changes and the application of social legislation."
    },
    {
      "url": "https://www.naukrigulf.com/growth-hacker-jobs-in-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126501462",
      "title": "Growth Hacker",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Research and identify growth opportunities, optimize marketing tactics, and analyze competitive landscapes while requiring a bachelor's degree and strong communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMissions / What you will do\nResearching and understanding the company's long-term goals.\nPinpointing issues that are hampering growth for the business.\nChoosing, setting, and prioritizing growth goals for the company.\nIdentifying growth opportunities for the company.\nTesting and optimizing marketing tactics for customer acquisition and conversion rate optimization\nConducting and presenting competitive analyses and market research\nProposing new initiatives to attract prospects and convert leads as well as testing new approaches to capture existing demand\nTranslating ideas to actionable items that deliver business results\nAnalyzing, recommending and lead the implementation of improvement initiatives\nKeep abreast with the latest trends and changes in the digital marketing"
    },
    {
      "url": "https://www.naukrigulf.com/cyber-security-analyst-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501459",
      "title": "Cyber Security Analyst",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Assist in vulnerability management, update security policies, support incident response, and contribute to Zero Trust initiatives while possessing a diploma in Cyber Security.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAs a Cyber Security Analyst, you will:\nAssist with the setup and day-to-day management of tools for vulnerability management and threat detection.\nHelp update and maintain security policies, procedures, and standards to stay compliant with best practices and regulations.\nSupport SIEM/SOAR operations by tuning alerts, adjusting rules, and working with DevOps on incident triage.\nTake part in post-incident reviews to evaluate and improve our security controls.\nWork closely with R&D and DevOps to ensure strong access controls, endpoint protection, and patch management.\nUse tools like Microsoft Defender and Azure Security Center to help prioritize remediation efforts based on risk.\nContribute to the rollout and improvement of Zero Trust security initiatives.\nMonitor logs across systems, firewalls, and applications to support timely detection and response to potential threats.\nParticipate in regular risk assessments, documenting findings and suggesting actionable improvements.\nJoin incident response reviews and help implement lessons learned to prevent future issues.\nExplore new security tools and automation opportunities to help us stay ahead of threats.\n\n\nWhy Join Us?\nMake an Impact: Youll help protect critical systems, data, and infrastructure from real-world threats.\nWork with Modern Tools: We use the latest in cloud-native security, automation, and DevSecOps practices."
    },
    {
      "url": "https://www.naukrigulf.com/sales-development-representative-jobs-in-tunis-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501455",
      "title": "Sales Development Representative",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for lead generation, customer relationship management, and market intelligence; requires strong analytical skills and proficiency in multiple languages.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nProspecting, Lead generation, and new customer relationships establishment\nMarket and competitive intelligence\nIdentifying customer needs\nPresenting our company and its products to stimulate the interest of prospects for a Proof Of Concept demo\nExploitation of Vneruon CRM to log and update all activities\nCustomer Proposal Management\nWork closely with the Account Management team to convert detected opportunities into new customers"
    },
    {
      "url": "https://www.naukrigulf.com/english-speaker-lead-generation-specialist-jobs-in-tunisia-in-vneuron-1-to-3-years-n-cd-10009202-jid-230126501453",
      "title": "English Speaker Lead Generation Specialist",
      "company": "Vneuron",
      "experience": "1 - 3 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsibilities include data cleaning, lead sourcing, data enrichment, qualification, and collaboration with sales and marketing teams; requires analytical skills and excellent...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMissions / What you will do\nData Cleaning and Maintenance:\nRegularly review and clean CRM data to ensure accuracy and completeness.\nIdentify and rectify any inconsistencies or errors within the database\nLead Sourcing:\nUtilize various sources to identify and gather potential leads for different sectors and regions.\nImplement effective strategies to maximize lead generation efforts.\nData Enrichment:\nEnhance CRM data by gathering additional information relevant to leads, including industry trends, company news, and contact details.\nQualification:\nEvaluate lead quality and relevance to ensure alignment with our target audience.\nImplement lead scoring methods to prioritize high-potential leads.\nCollaboration:\nWork closely with the sales and marketing teams to align lead generation efforts with overall business objectives.\nProvide regular updates on lead generation metrics and performance."
    },
    {
      "url": "https://www.naukrigulf.com/systems-and-network-administrator-jobs-in-tunis-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126500106",
      "title": "Systems and Network Administrator",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Install, configure and deploy hardware, provide technical support, manage inventory, requiring strong analytical skills and knowledge of Linux and Windows environments.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nInstall, configure and deploy computer hardware and security equipment, assist users, resolve technical issues, manage IT purchases and monitor inventory to ensure smooth operation.\n\n\nAssignment :\nAssemble, install and commission new computer hardware and security equipment.\nProvide technical support to users.\nDiagnose and resolve equipment malfunctions.\nOrdering computer equipment.\nMonitor stock levels.\n\nRequired skills:\nLinux and Windows environments.\nGood knowledge of LAN networks.\nPassionate about new technologies.\nVersatile, rigorous and well organized\nAbility to work under pressure.\nAbility to manage emergencies.\n\nWhat do we propose?\nThe opportunity to work in stimulating environments and contribute to a positive impact on a global scale\nOpportunities for career advancement and development\nHealth and wellness benefits for you and your family\nA dynamic and pleasant environment, fostering the acquisition of new skills\nWorking conditions adapted to allow you to focus on what you love doing\nA high-performing team built on respect, sharing, and a passion for the profession\nEqual opportunities in employment, without distinction of gender, religion, culture or other\n\nNext step\nDo you have the audacity and the will to succeed? Don't wait any longer, come and contribute to your success and ours!\n\nFollow us on LinkedIn to learn more about our Spark team and our solutions."
    },
    {
      "url": "https://www.naukrigulf.com/senior-software-qa-engineer-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126500105",
      "title": "Senior Software QA Engineer",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for defining Quality Assurance processes, developing test plans, conducting test automation, and collaborating with teams to ensure quality software delivery.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nSoftware Quality testing is a necessity as we believe that it is the key to reach perfection. Your main mission will be to prove that our software is broken and to detect its failures and defects.\nYour will :\nDefine and drive the Quality Assurance processes using both manual and automated testing.\nDevelop software test plans and perform test validation scenarios\nDevelop and conduct test automation scripts\nLead the team on technical aspects and participate in its development\nIdentify, document and track anomalies and non-conformances\nReview technical specifications\nEnsure quality deliveries and respect of project requirements\nCollaborate with multidisciplinary teams : Product, r&d, BA, delivery\nEnsure a continuous improvement of our QA process\nProvide regular reports\nMake it work, make it right, make it fast.i> em> Kent Beck/em> /i>"
    },
    {
      "url": "https://www.naukrigulf.com/specialist-in-sales-prospecting-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500104",
      "title": "Specialist in Sales Prospecting",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsibilities include lead generation, client relationship building, and market monitoring; requires strong analytical skills and proficiency in French and English.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nProposed Missions\n\nProspecting, lead generation and establishing new relationships with clients.\nMonitoring the market and the competition.\nDetermine customer needs.\nPresenting our company and its products to stimulate the interest of prospects for a proof-of-concept demonstration.\nUsing Vneuron CRM to record and update all activities.\nManaging customer proposals.\nWorking closely with the account management team to convert identified opportunities into new clients.\n\n\nDesired profile\n\nA degree in French language, computer science, finance or a huge interest in these three fields.\nYou have strong analytical and problem-solving skills.\nYou have excellent interpersonal and communication skills.\nYou are dynamic and enterprising.\nAn excellent level of written and spoken French is imperative.\nA good level of English is appreciated.\nA good level in a third language (Spanish, Turkish, Portuguese).\nA strong interest and desire to progress in the commercial field.\nUnderstanding the sales process is an asset."
    },
    {
      "url": "https://www.naukrigulf.com/account-manager-jobs-in-tunisia-in-vneuron-5-to-10-years-n-cd-10009202-jid-230126500101",
      "title": "Account Manager",
      "company": "Vneuron",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Lead client relationships, drive sales cycles, and ensure customer nurturing with excellent negotiation skills and strong communication in English and French.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nLead impactful client relationships by identifying opportunities, shaping tailored solutions, driving the full sales cycle and closing strategic deals, while representing our company with excellence and delivering insightful reporting.\nVneuron is a fast-growing RegTech company helping financial institutions stay ahead of compliance and risk challenges. Our solution, Reis RCS, supports banks and financial services in fighting financial crime through advanced technology.\nIn 2025, Vneuron was named among the Top Innovators in the FinCrimeTech50 and won the Best Compliance as a Service Solution at the RegTech Insight Awards Europe. Weve also been recognized in the RegTech100 for the fourth year in a row on a global list of the most innovative companies in the field.\nIf you're looking to join a team thats making a real impact in the world of compliance and technology, Vneuron is the place to be.\nVneuron puts the development of its team at the heart of its priorities. We provide a pleasant and comfortable work environment. Our organizational structure is flat and collaborative, and our management is available and present.\nWe invite you to be part of a passionate and committed young team who values respect and sharing spirit. You will be surrounded by highly skilled technical and functional experts willing to guide you to evolve in all aspects of your career.\nWe believe that every person is unique and special. Thus, we provide attentive and active listening to your ideas and propositions as we believe that you will have an essential role in achieving our next milestone and shaping the future of Vneurons value proposition.\nWhat you will be doing\nProspect territories and Qualify Business opportunities\nParticipate in Business Development Strategies\nEnsure Customer Nurturing by developing good relationships with potential interlocutors\nParticipate in well responding to proposals with the collaboration of the presales team\nAnalyze prospects' and customers need\nRepresent our Company and products\nEnsure the coordination and supervision of the whole sale process\nEnsure financial negotiations and contracts conclusion\nPrepare regular reporting\nWhat do we offer?\nThe opportunity to work in exciting contexts and to help generate a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment that challenges you to develop new skills\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing, and Passion for what it does\nEqual Employment Opportunities no matter your gender, religious, culture, etc\nYour Next Steps\nIf you have the ambition to stimulate your career with new challenges while capitalizing on your potential and your perpetual thirst for learning, this job is for you.\nApply Now and become the next Spark!\nFollow us on LinkedIn to learn more about the Spark team and our Spark solutions.\nWe would be delighted to meet you and give you much more information!"
    },
    {
      "url": "https://www.naukrigulf.com/senior-accountant-jobs-in-tunisia-in-vneuron-3-to-5-years-n-cd-10009202-jid-230126500098",
      "title": "Senior Accountant",
      "company": "Vneuron",
      "experience": "3 - 5 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Manage general and analytical accounting, prepare monthly tax returns, ensure accounting consistency, and possess strong knowledge of Tunisian standards and payroll processes.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nTo manage general and analytical accounting , including the entry of accounting transactions of all kinds\nPrepare monthly tax and social security returns in compliance with regulatory deadlines.\nParticipate in the preparation of the monthly report\nPerform bank reconciliations\nEnsuring the consistency of accounting entries"
    },
    {
      "url": "https://www.naukrigulf.com/french-speaking-lead-generation-specialist-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500096",
      "title": "French-speaking Lead Generation Specialist",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "The role involves data cleaning, lead generation, and collaboration with sales teams, requiring strong analytical skills and excellent written French.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nVneuron prioritizes the development of its employees and enables its teams to work in optimal conditions.\nWe invite you to join a young, passionate team driven by a taste for challenge. We also uphold the values of respect , commitment , and growth .\nWe believe that each person is unique and special. Therefore, we listen carefully and actively to your ideas and suggestions because we believe you will play a vital role in the realization of our next step.\nYou will also be surrounded by technical and functional experts to help you progress in your professional career.\nTo strengthen our global presence, we are looking for a Lead Generation Specialist based in Tunisia.\nMissions, Proposals\nData cleaning and updating:\nRegularly review and clean CRM data to ensure accuracy and completeness.\nIdentify and correct any inconsistencies or errors in the database.\nMain supply:\nUse various sources to identify and gather potential leads for different sectors and regions.\nImplement effective strategies to maximize lead generation efforts.\nData enrichment:\nEnhance CRM data by collecting additional information relevant to prospects, including industry trends, company news, and contact information.\nQualification :\nevaluate the quality and relevance of the leads to ensure their alignment with our target audience.\nImplement prospect scoring methods to prioritize high-potential prospects.\nCollaboration :\nWorking closely with the sales and marketing teams to align lead generation efforts with overall business objectives.\nProvide regular updates on lead generation metrics and performance."
    },
    {
      "url": "https://www.naukrigulf.com/senior-customer-solutions-consultant-presales-engineer-jobs-in-tunis-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500095",
      "title": "Senior Customer Solutions Consultant / Presales Engineer",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Support sales productivity by qualifying leads, analyzing needs, preparing presentations, and collaborating with teams; requires IT background and strong communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nThe Customer Solution Consultant supports sales productivity and deal flow by securing the technical win. He collaborates with sales, support, product, and development teams in order to propose the best-suited deals for potential prospects.\n\nMissions :\nQualify potential leads and sales opportunities.\nInvestigate and analyze prospects' needs.\nElaborate commercial propositions including technical and functional aspects.\nCollaborate with multidisciplinary teams to reach the needed information.\nPrepare high-quality Proof of Concept (POC) presentations for potential prospects demonstrating how we can satisfy their need and convince them with Vneurons solution.\nEnsure negotiations and Q/A sessions\nDrive market and competitive intelligence\n\nRequired profile :\nIT background\nSignificant experience in Pre-Sales position\nExcellent analytical and problem-solving skills\nExcellent interpersonal and communication skills\nDynamic, self-starter, curious and empathetic\nGood written and verbal English level\nGood written and verbal French level\nSharp, clear, and structured communicator\n\nNice to have:\nEngineering degree\nExperience in IT sales\nKnowledge in the Risk & Compliance field\n\n\n\nBenefits\nThe opportunity to work in exciting contexts and to help generate a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment that challenges you to develop new skills\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing and Passion for what it does\nEqual Employment Opportunities no matter your gender, religion, culture, etc.\n\n\n\n\nNext steps\n\nIf you have the ambition to stimulate your career with new challenges while capitalizing on your potential and your perpetual thirst for learning, this job is for you.\n\nApply Now and become the next Spark!\n\nFollow us on LinkedIn to learn more about the Spark team and our Spark solutions.\nWe would be thrilled to meet you and give you much more information!"
    },
    {
      "url": "https://www.naukrigulf.com/risk-compliance-and-legal-officer-jobs-in-tunisia-in-vneuron-5-to-10-years-n-cd-10009202-jid-230126500094",
      "title": "Risk, Compliance and Legal Officer",
      "company": "Vneuron",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for identifying compliance risks, preparing regulatory reports, and drafting agreements; requires a Master's degree and strong analytical skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n1. Operational Tasks - RCCI\nIdentifying compliance risks\nUpdating the risk map\nWriting, analyzing, and enhancing the effectiveness and relevance of existing tools\nImplementing and executing the ongoing control strategy\nRegulatory monitoring: identifying national regulatory developments and international recommendations that could affect the company's operations\nTracking incidents and complaints\nManaging relationships with regulatory authorities\nPromoting ethical conduct\nEstablishing effective compliance programs\n2. Reporting\nPreparation of regulatory reports\nDevelopment of periodic activity reports, reporting, and documentation for our clients\nParticipation in committees/meetings\n3. Contractual aspects\nDrafting and updating product sales agreements with various partner institutions.\nMonitoring customer relationships.\nAssist in contract negotiations to achieve favorable terms and conditions.\nProvide guidance and support to internal stakeholders during the negotiation process."
    },
    {
      "url": "https://www.naukrigulf.com/account-delivery-manager-with-italian-jobs-in-tunisia-in-hewlett-packard-5-to-7-years-n-cd-10001411-jid-160226500983",
      "title": "Account Delivery Manager with Italian",
      "company": "Hewlett-Packard",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "16 hrs ago",
      "description_preview": "Manage on-site software service delivery, ensuring customer satisfaction through technical support, relationship building, and proactive problem-solving while leveraging advance...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nJob Family Definition:\nWithin the family there is a range of technical and managerial customer on-site functions. The family of jobs is focused on managing the onsite delivering of software services, pre-sales, post-sales or service delivery support, installation and configuration for customer environments. The jobs solve various business systems, networking and applications problems for standard industry servers, specialized or complex clustered environments. Deliver reactive and proactive activities according to Service Level Agreement to ensure customer satisfaction and loyalty. Provides direct post-sales systems on site technical support for reactive and proactive customers. Each position maintains a high level of customer satisfaction by ensuring clear business and technical solution alignment, clarifying customer needs and ensuring that they are met. Jobs are responsible for company Total Customer Experience as well as the revenue growth, profitability, and account retention.\nManagement Level Definition:\nApplies developed subject matter knowledge to solve common and complex business issues and recommends appropriate alternatives. Works on problems of diverse complexity and scope. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision making process. Exercises independent judgment to identify and select a solution. Ability to handle most unique situations. May seek advice in order to make decisions on complex business issues.\nResponsibilities:\nApply advanced technical knowledge to operate one or more technology areas (e.g. server administration, technical security management, performance management) or customer groups that are critical or high- risk.\nIntegrate technical knowledge and business understanding to create. solutions for customers.\nResolve single- and cross- technology incidents independently. Work with team members to resolve unusually complex or cross- technology incidents.\nProactively and reactively look for solutions to prevent problems from occurring in team/technology area.\nApply company solutions to meet highly complex customer needs.\nIdentify additional services that could lead to future service revenue growth.\nProvide technical consulting during contract renewal discussions.\nBuild and maintain strong relationship up to senior management level in assigned accounts.\nDesign and deliver support solutions using specific industry knowledge and expertise.\nAssist in managing delivery of industry support solutions.\nLead Customer Expectation management as part of escalation process.\nLead cross-team or large programs/projects.\nCoach or guide junior consultants.\nKnowledge and Skills:\nThorough knowledge of company products and services offerings, company organization, competition, third party products and market trends.\nBroad knowledge of corporate organization, job, and policies.\nComprehensive business, technical or functional knowledge at an expert level.\nCommunicate tactfully with diplomacy up to senior management levels within an organization.\nActive listening skills and ability to adjust messages to audience level.\nProblem-solving skills (proactive, reactive and creative).\nAble to employ exemplary consulting skills by becoming a trusted advisor to the customer and providing clarity to solution determination.\nWell versed in core technical competencies and peaked in some technical area(s) intermediate skills in project management, communication, analysis and presentation.\nProvide suggestions for operational efficiencies."
    },
    {
      "url": "https://www.naukrigulf.com/account-support-manager-with-italian-jobs-in-tunisia-in-hewlett-packard-5-to-10-years-n-cd-10001411-jid-160226500982",
      "title": "Account Support Manager with Italian",
      "company": "Hewlett-Packard",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "16 hrs ago",
      "description_preview": "Manage customer support and technical solutions, ensuring satisfaction and account retention while possessing advanced technical knowledge and fluency in Italian.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nJob Family Definition:\nWithin the family there is a range of technical and managerial customer on-site functions. The family of jobs is focused on managing the onsite delivering of software services, pre-sales, post-sales or service delivery support, installation and configuration for customer environments. The jobs solve various business systems, networking and applications problems for standard industry servers, specialized or complex clustered environments. Deliver reactive and proactive activities according to Service Level Agreement to ensure customer satisfaction and loyalty. Provides direct post-sales systems on site technical support for reactive and proactive customers. Each position maintains a high level of customer satisfaction by ensuring clear business and technical solution alignment, clarifying customer needs and ensuring that they are met. Jobs are responsible for company Total Customer Experience as well as the revenue growth, profitability, and account retention.\nManagement Level Definition:\nApplies developed subject matter knowledge to solve common and complex business issues and recommends appropriate alternatives. Works on problems of diverse complexity and scope. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision making process. Exercises independent judgment to identify and select a solution. Ability to handle most unique situations. May seek advice in order to make decisions on complex business issues.\nResponsibilities:\nApply advanced technical knowledge to operate one or more technology areas (e.g. server administration, technical security management, performance management) or customer groups that are critical or high- risk.\nIntegrate technical knowledge and business understanding to create. solutions for customers.\nResolve single- and cross- technology incidents independently. Work with team members to resolve unusually complex or cross- technology incidents.\nProactively and reactively look for solutions to prevent problems from occurring in team/technology area.\nApply company solutions to meet highly complex customer needs.\nIdentify additional services that could lead to future service revenue growth.\nProvide technical consulting during contract renewal discussions.\nBuild and maintain strong relationship up to senior management level in assigned accounts.\nDesign and deliver support solutions using specific industry knowledge and expertise.\nAssist in managing delivery of industry support solutions.\nLead Customer Expectation management as part of escalation process.\nLead cross-team or large programs/projects.\nCoach or guide junior consultants.\nEducation and Experience Required:\nBachelor's degree preferred or Associate degree holder (technical field) with 5- 7 years working experience in related fields desired.\nKnowledge and Skills:\nThorough knowledge of company products and services offerings, company organization, competition, third party products and market trends.\nBroad knowledge of corporate organization, job, and policies.\nComprehensive business, technical or functional knowledge at an expert level.\nCommunicate tactfully with diplomacy up to senior management levels within an organization.\nActive listening skills and ability to adjust messages to audience level.\nProblem-solving skills (proactive, reactive and creative).\nAble to employ exemplary consulting skills by becoming a trusted advisor to the customer and providing clarity to solution determination.\nWell versed in core technical competencies and peaked in some technical area(s) intermediate skills in project management, communication, analysis and presentation.\nProvide suggestions for operational efficiencies."
    },
    {
      "url": "https://www.naukrigulf.com/business-operations-lead-tunis-hub-jobs-in-tunisia-in-hewlett-packard-8-to-13-years-n-cd-10001411-jid-110226500800",
      "title": "Business Operations Lead Tunis HUB",
      "company": "Hewlett-Packard",
      "experience": "8 - 13 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "11 Feb",
      "description_preview": "Lead operational excellence and transformation initiatives, driving governance, performance management, and innovation to optimize customer experience and organizational perform...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nWe are looking for Business Operations Lead Tunis HUB to join our team!\nLead and orchestrate operational excellence for the Global Technical Support Tunis HUB and Geos by driving governance, performance management, and transformation initiatives. Act as the strategic enabler and single point of accountability for operational processes, ensuring alignment with corporate objectives and bold goals. Deliver executive-level business reviews, foster collaboration across hubs, and champion innovation through automation, analytics, and continuous improvement to optimize customer experience and organizational performance.\nHow you will make your mark:\nOperational Excellence & Governance\nDeploy and measure Objectives and Key Results (OKRs) aligned with Business bold goals.\nDefine and track KPIs across Global Technical Support.\nDrive performance reviews and ensure alignment with organizational goals.\nLead operational excellence through standardization, simplification, and automation of business processes.\nOwn HUB governance and policies, ensuring compliance and driving metrics leadership.\nEnable end-to-end customer experience through analytics, insights, and dashboards.\nStandardize processes, enforce compliance, and mitigate risks.\nCollaborate with Ops Leads, SME s and hubs globally to ensure operational excellence.\nPrepare and deliver Quarterly Business Reviews (QBRs) and organizational performance reports for senior leadership.\nConsolidate insights into clear, actionable narratives for executive decision-making.\nStrategy, Planning & Transformation\nDrive internal transformation projects across the organization.\nDrive cost optimization and ROI tracking for transformation projects.\nDrive financial discipline across the organization.\nBuild and lead current and future Cap-Cap models.\nEnsure timely delivery of milestones and adoption of new processes.\nOwn and deploy the Organization s Plan of Record (PoR).\nContribute to strategic planning and governance frameworks that optimize operational performance.\nAlign resource planning with business priorities.\nAlign operational priorities with corporate objectives and transformation roadmaps.\nServe as the bridge between business strategy and execution, ensuring operational readiness for growth initiatives.\nPromote collaboration across HPE Operations and hubs.\nInnovation & Continuous Improvement\nChampion innovation and automation initiatives to modernize operations.\nIncubate ideas for process automation, AI-driven analytics, and digital transformation.\nIdentify opportunities for process optimization and digital transformation.\nDrive operational maturity assessments and benchmark against industry best practices."
    },
    {
      "url": "https://www.naukrigulf.com/salesforce-business-analyst-jobs-in-tunis-tunisia-in-questel-2-to-6-years-n-cd-40001777-jid-090226500561",
      "title": "Salesforce Business Analyst",
      "company": "Questel",
      "experience": "2 - 6 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "9 Feb",
      "description_preview": "The role involves analyzing business needs, documenting requirements, conducting testing, and improving Salesforce processes while collaborating with stakeholders and teams.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40001777/40001777_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nPosition Overview:\nThe Salesforce Business Analyst is responsible for analyzing, translating, and documenting business needs to support the implementation and optimization of Salesforce-based platforms, including Equinox Corporate+ and Equinox Invention. Acting as a bridge between business and technology, this role ensures that functional requirements are clearly defined, and solutions are delivered to meet end-user expectations.\nPrincipal Duties & Responsibilities:\n\nCollaborate with internal stakeholders and Solution Engineers to gather, analyze, and document functional requirements\n\nTranslate business needs into user stories and define acceptance criteria for development and testing\n\nOrganize and lead functional testing campaigns and user acceptance testing (UAT) in sandbox and Trials environments\n\nCoordinate with Salesforce administrators and developers on deployment activities, including Change Sets, Salesforce CLI, and Git workflows\n\nValidate successful implementation of new features, proactively monitor actions, and resolve any post-deployment issues\n\nIdentify opportunities for continuous improvement of Salesforce business processes and platform usability\n\nMaintain user documentation and functional documentation and user guides to promote the adoption of implemented solutions\n\nParticipate in Agile ceremonies and ensure alignment between solutions and business priorities\n\nStay current on Salesforce platform developments and assess potential impact on current systems\n\nCollaborate with cross-functional teams and R&D teams supporting the Orbit Invention platforms to support functional evolution and optimization\n\nWork on special projects and other duties as assigned by management\n\nQualifications & Skills:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential function.\nEducation and Experience: Bachelor s degree in Business Administration, Information Systems, Computer Science, or a related field preferred; or any combination of education, experience and training which provides the following knowledge, skills and abilities:\n\nMinimum 2 years of experience in Salesforce functional analysis and implementation required\n\nSalesforce Business Analyst Certification preferred\n\nProficient in Salesforce native tools such as Flows, Validation Rules, and Custom Objects\n\nUnderstanding of APEX and SOQL\n\nFamiliar with Salesforce Sandbox Management, Change Sets, Salesforce CLI, and Git\n\nExperience using tools such as JIRA, Confluence, and working within Agile/Scrum frameworks\n\nStrong analytical, organizational, and documentation skills\n\nExcellent verbal and written communication in English\n\nSelf-starter with the ability to work independently and collaboratively across teams\n\nEffective at managing multiple priorities in a fast-paced, global environment\n\nAdaptable, solutions-oriented and proactive in identifying improvements\n\nThis job description may evolve based on business needs."
    },
    {
      "url": "https://www.naukrigulf.com/marketing-intern-mea-jobs-in-tunis-tunisia-in-sbs-software-1-to-2-years-n-cd-40003719-jid-090226500021",
      "title": "Marketing Intern MEA",
      "company": "SBS Software",
      "experience": "1 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "9 Feb",
      "description_preview": "Assist in implementing marketing plans, organizing events, coordinating with teams, and analyzing campaign performance; requires strong organizational skills and fluency in Fren...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40003719/40003719_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\nJob Description\nOur international and collaborative marketing team designs and implements digital campaigns, events, go-to-market strategies, and communication programs that enhance the global visibility of the SBS brand. As a marketing intern for the MEA region , you will work closely with the sales and marketing teams to develop and implement local initiatives that directly support business growth.\nYour tasks\nContribute to the implementation of the operational marketing plan for the MEA region.\nHelping with event organization.\nEnsure coordination with agencies, suppliers and service providers to guarantee quality and adherence to deadlines.\nEnsure the monitoring of local campaigns (emails, content, sales materials, localized social networks).\nMonitor and analyze the performance of field activities (reports, measurement of return on investment, recommendations).\nEnsure continuous monitoring of key achievements in the region (new contracts, strategic signings, go lives, business milestones).\nCoordinate with local teams (sales, delivery, management) to collect, qualify and validate information.\nQualifications\nCurrently enrolled in a bachelor's or master's degree (M1/M2) in marketing, business, communication or a related field.\nStrong organizational skills, attention to detail and a proactive mindset.\nExcellent interpersonal and writing skills.\nProficient in PowerPoint and Excel; experience with CRM or marketing automation tools is a plus.\nFluency in French and English is required."
    },
    {
      "url": "https://www.naukrigulf.com/release-manager-jobs-in-tunis-tunisia-in-neoxam-tunisie-3-to-8-years-n-cd-40001082-jid-030226501119",
      "title": "Release Manager",
      "company": "NeoXam Tunisie",
      "experience": "3 - 8 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "3 Feb",
      "description_preview": "Responsible for planning and managing software releases, ensuring quality and coordination among teams, with expertise in SDLC, Agile, and CI/CD.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40001082/40001082_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAs part of NeoXam s R&D department, the Release Manager is responsible for planning, coordinating, and managing DataHub software releases across multiple environments and projects. This role ensures smooth deployment of new features, enhancements, and fixes by aligning development, testing, and business teams. The Release Manager oversees the end-to-end release lifecycle from planning and build integration to testing, deployment, and post-release validation ensuring minimal disruption and maximum quality.\nMISSION\nRelease Planning & Governance\nDefine, document, and manage the overall release calendar across multiple stakeholders.\nCollaborate with product owners, development leads, and the QA team to identify release scope and dependencies.\nEstablish and maintain release governance standards, policies, and processes.\nCoordination & Communication\nAct as the central point of contact for all release-related activities and communications.\nFacilitate release readiness reviews, go/no-go meetings, and post-release retrospectives.\nCommunicate release scope, milestones, and risks to all stakeholders.\nRelease Execution & Deployment\nCoordinate build deployments and ensure version control, tagging, and release documentation are properly maintained.\nManage deployment pipelines (CI/CD) in collaboration with DevOps and Infrastructure teams.\nEnsure rollback, recovery, and contingency procedures are in place and tested.\nQuality & Risk Management\nMonitor release quality by aligning with QA team on testing outcomes and defect tracking.\nIdentify potential risks and conflicts early in the release cycle and drive mitigation strategies.\nTrack release metrics (success rate, failure rate, deployment time, etc.) to improve future performance.\nAutomation & Continuous Improvement\nPartner with DevOps to streamline and automate release processes where feasible.\nContinuously review and enhance release processes for efficiency, predictability, and scalability.\nPROFILE\nStrong understanding of SDLC, Agile, DevOps, and CI/CD principles.\nExcellent organizational and stakeholder management skills.\nHands-on experience with release tools such as Jira, Git, Bitbucket, Jenkins, Artifactory, good to have Azure DevOps, or GitLab CI/CD.\nProven experience managing releases across multiple environments and teams (DEV, QA, UAT, PROD).\nStrong analytical and problem-solving abilities.\nProven ability to work under pressure and manage multiple concurrent releases.\nIt s even better if you have :\nExperience in regulated industries (finance, healthcare, etc.) with controlled release processes.\nPMO, Agile/Scrum or ITIL certification(s)\nFamiliarity with cloud environments (AWS, Azure, GCP).\nWe are looking for a highly rigorous and persistent professional with excellent communication skills and the ability to drive and promote best practices across teams.\nYou will also bring a continuous improvement mindset and strong capabilities in risk management and issue resolution to support the team s performance and long-term success.\nWHAT WE OFFER\nA permanent contract (CDI).\nA pleasant and collaborative work environment, where team spirit is key.\nAn attractive compensation package, including a fixed salary, performance bonus, meal vouchers, health and life insurance.\nA flexible and hybrid work model, combining remote work and on-site presence.\nAnd much more..."
    },
    {
      "url": "https://www.naukrigulf.com/junior-devops-engineer-jobs-in-tunisia-in-think-tank-business-solutions-ag-1-to-3-years-n-cd-40002442-jid-290126501720",
      "title": "Junior DevOps Engineer",
      "company": "think tank Business Solutions AG",
      "experience": "1 - 3 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "29 Jan",
      "description_preview": "Responsible for developing cloud computing solutions, performing application maintenance, and utilizing DevOps tools with strong programming and communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/40002442/40002442_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nResponsibilities:\nResponsible for working with development teams to translate scalability, performance, reliability, and functional requirements to virtualized/cloud computing solutions with strong capacity in the management of cloud computing clusters.\nYou will be responsible for routine application maintenance tasks, create requirements and procedures for implementing routine maintenance and troubleshooting existing information systems for errors, and resolving errors\nYou will be responsible for developing and building IT solutions and installing and configure solutions, implement reusable components, translate technical requirements, assist with all stages of test data, develop interface stubs and simulators, and perform script maintenance and updates,\nParticipate in the processes of strategic project-planning meetings and providing guidance and expertise on system options,\nQualifications:\nKnowledge of best practices in support of IT operations and a good understanding of programming languages, including Java, br>\nHands-on experience with configuration and use of DevOps tools and software process automation with popular scripting languages (Perl, python, ruby, shell, javascript ..).br>\nProficiency in Cloud Services: Amazon web services. Microsoft Cloud Azure, Google Cloud, ../\nGood understanding of System Administration: Monitoring Tools, Networking concepts, Backups.br>\nGood experience in terms of build, release, and configuration management in a CI/CD environment (version control, CM, ).br>\nAbility to work with containerization platforms such as Kubernetes, Docker; cloud provisioning software, including Ansible, br>\nProvide high performance cloud deployment solutions and maintain rapid deployment pipelines,br>\nCurrent understanding of best practices regarding system security measures.br>\nStrong written communications skills are necessary for writing clear and concise documentation also as well as verbal communication skills to relate with team members, clients, and others in a workplace./p>"
    },
    {
      "url": "https://www.naukrigulf.com/l1-storage-support-engineer-with-spanish-jobs-in-tunisia-in-hewlett-packard-0-to-1-year-n-cd-10001411-jid-270126503033",
      "title": "L1 Storage Support Engineer with Spanish",
      "company": "Hewlett-Packard",
      "experience": "0 - 1 Year",
      "location": "Tunisia - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "Provide technical support for hardware and software issues, ensuring customer satisfaction and effective communication in Spanish while resolving problems.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\n\nJob Description:\nWe are looking for L1 Support Engineer with Spanish language to join our team!\nHow you ll make your mark:\nSuccessfully resolve technical issues (hardware and software) from incoming internal or external businesses and end user's contacts and proactive notification systems.\nRespond to service, product, technical, and customer- relations questions on subjects such as features, specifications, and repairs on current and discontinued products, parts, and options, based on customer entitlement (warranty through mission-critical). .\nResolve incoming internal or external businesses and end user's problems via telephone and e-support.\nArticulate both in writing and verbally case summary, resolution and add to Knowledge Management System (KMS).\nProactively assist customers to avoid or reduce problem occurrence.\nRepresent the company in a face to face customer location visit, industry conference/trade show, vendor meeting, etc.\nEngage team members for support as required to ensure internal or external business and end user SLA demands are met.\nBegin to partner with and assist the Sales Pursuit team.\nAbout you:\n0-1 year experience in relevant technologies and customer environments.\nRelevant industry qualification where applicable\nExcellent verbal and written communication skills in language to be supported.\nExperience in troubleshooting in a technical environment.\nExcellent analytical and problem solving skills.\nSoftware and hardware knowledge of computing, storage and peripheral devices.\nAdvanced proficiency with case management databases and tools.\nSuperior customer service skills.\nPhone and remote support experience. E-support experience.\nFluent Spanish language\n\n\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have whether you want to become a knowledge expert in your field or apply your skills to another division.\nUnconditional Inclusion\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know varied backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    },
    {
      "url": "https://www.naukrigulf.com/l1-storage-support-engineer-italian-jobs-in-tunisia-in-hewlett-packard-0-to-1-year-n-cd-10001411-jid-270126500900",
      "title": "L1 Storage Support Engineer Italian",
      "company": "Hewlett-Packard",
      "experience": "0 - 1 Year",
      "location": "Tunisia - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "The role involves resolving technical issues, providing customer support, and requires excellent communication skills in English and Italian.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10001411/10001411_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n\nJob Description:\nWe are looking for L1 Storage Support Engineer with Italian language to join our team!\nHow you ll make your mark:\nSuccessfully resolve technical issues (hardware and software) from incoming internal or external businesses and end user's contacts and proactive notification systems.\nRespond to service, product, technical, and customer- relations questions on subjects such as features, specifications, and repairs on current and discontinued products, parts, and options, based on customer entitlement (warranty through mission-critical). .\nResolve incoming internal or external businesses and end user's problems via telephone and e-support.\nArticulate both in writing and verbally case summary, resolution and add to Knowledge Management System (KMS).\nProactively assist customers to avoid or reduce problem occurrence.\nRepresent the company in a face to face customer location visit, industry conference/trade show, vendor meeting, etc.\nEngage team members for support as required to ensure internal or external business and end user SLA demands are met.\nBegin to partner with and assist the Sales Pursuit team.\nAbout you:\n0-1 year experience in relevant technologies and customer environments.\nRelevant industry qualification where applicable\nExcellent verbal and written communication skills in language to be supported.\nExperience in troubleshooting in a technical environment.\nExcellent analytical and problem solving skills.\nSoftware and hardware knowledge of computing, storage and peripheral devices.\nAdvanced proficiency with case management databases and tools.\nSuperior customer service skills.\nPhone and remote support experience. E-support experience.\nFluent English and Italian languages\nAdditional Skills:\nAccountability, Accountability, Action Planning, Active Learning, Active Listening, Bias, Business Growth, Business Planning, Coaching, Commercial Acumen, Creativity, Critical Thinking, Cross-Functional Teamwork, Customer Experience Strategy, Customer Solutions, Data Analysis Management, Data Collection Management (Inactive), Data Controls, Design Thinking, Empathy, Follow-Through, Growth Mindset, Intellectual Curiosity (Inactive), Long Term Planning, Managing Ambiguity {+ 5 more}\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have whether you want to become a knowledge expert in your field or apply your skills to another division.\nUnconditional Inclusion\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know varied backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good."
    },
    {
      "url": "https://www.naukrigulf.com/software-integration-consultant-jobs-in-tunis-tunisia-in-vneuron-3-to-5-years-n-cd-10009202-jid-270126500137",
      "title": "Software Integration Consultant",
      "company": "Vneuron",
      "experience": "3 - 5 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "27 Jan",
      "description_preview": "Implement software integrations, analyze requirements, configure solutions, and document technical implementations while possessing strong analytical and communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nImplement seamless software integrations,analyze requirements, draft specs, configure and develop solutions, connect REIS with client systems, model business rules, support deployment and document technical implementations.\n\n\nAbout Vneuron and Reis RCS\nVneuron is a fast-growing RegTech company helping financial institutions stay ahead of compliance and risk challenges. Our solution, Reis RCS , supports banks and financial services in fighting financial crime through advanced technology.\nIn 2025, Vneuron was named among the Top Innovators in the FinCrimeTech50 and won the Best Compliance as a Service Solution at the RegTech Insight Awards Europe. Weve also been recognized in the RegTech100 for the fourth year in a row a global list of the most innovative companies in the field.\nIf youre looking to join a team thats making a real impact in the world of compliance and technology, Vneuron is the place to be.\n\nOur Culture & Values\nVneuron puts the development of its team at the heart of its priorities. We provide a pleasant and comfortable work environment. Our organization is collaborative and flat-structured. And, our management is available and present.\nMoreover, We have a passionate and committed young team who values respect and sharing spirit. You will be surrounded by highly skilled experts willing to guide you to evolve in all aspects of your career. We aim to spread our innovative technology worldwide, so we can take part in generating a positive impact.\nWe believe that every person is unique and special. Thus, we provide attentive and active listening to your ideas and propositions as we believe that you will have an essential role in achieving our next milestone.\n\nWhy would you love to join us?\nChallenging context to expand your technical and professional skills\nOpportunity to start a promising career\nPleasant and comfortable work environment (Relaxation and play areas)\nWork along with our passionate and brilliant Spark team\nHighly qualified mentor to guide you through the realization of your project\nBeing surrounded by Highly skilled experts in different fields such as Software Architecture, Software Release Management, Software Quality Assurance, Project Management, Consulting, Selling, etc.\nEqual opportunity no matter your gender, religion, culture, color, etc.\n\nResponsibilities:\nAnalyze project requirements while considering the functionalities of the REIS suite.\nContribute to the drafting of technical specification documents.\nPerform configurations and developments required for the implementation of technical and functional requirements.\nIntegrate and implement interfacing mechanisms between the REIS suite and the clients information system.\nModel business rules and implement them in the REIS platform, following best practices.\nEstimate the workload needed to complete the technical part of the project.\nProvide support during the deployment and acceptance testing phases in the clients environment.\nWrite documentation for the implemented technical solutions.\n\nProfile:\nHaving a degree in Computer Science, ideally with a component in Business Management.\nHaving strong analytical skills, allowing for effective modeling and optimal implementation of business needs.\nDemonstrating rigor, method, and a solution-oriented mindset.\nPossessing excellent communication abilities and ease in collaborative environments.\nBeing adaptable and able to perform well under pressure.\nGood knowledge of JavaScript, Postman, Form.io, Freemarker, UML/BPMN, GitLab, SQL, and PostgreSQL.\nGood mastery of data integration mechanisms and tools such as Talend/ETL and Spring Integration.\nProficient in Microsoft Office tools.\n\nBenefits :\nThe opportunity to work on exciting projects that are generating a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment where diversity is applauded, and success is celebrated.\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing and Passion for what it does\nEqual Employment Opportunities : Gender, religious, culture equity\nPossibility to work remotely"
    },
    {
      "url": "https://www.naukrigulf.com/revenue-management-assistant-part-time-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501483",
      "title": "Revenue Management Assistant - Part-time",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Support revenue analysis, monitor key performance indicators, improve billing processes, and validate records; requires finance knowledge and proficiency in Excel.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nSupport revenue analysis and financial reporting.\nMonitor key performance indicators (MRR, TTM, churn rate, etc.).\nAssist in improving billing and collection processes.\nHelp prepare management presentations and reports.\nSupport revenue assurance by validating records against contracts.\n\nMain Responsibilities:\nSupport revenue analysis and financial reporting.\nMonitor key performance indicators (MRR, TTM, churn rate, etc.).\nAssist in improving billing and collection processes.\nHelp prepare management presentations and reports.\nSupport revenue assurance by validating records against contracts."
    },
    {
      "url": "https://www.naukrigulf.com/it-support-engineer-integration-specialist-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501481",
      "title": "IT Support Engineer - Integration Specialist",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Provide personalized IT support, troubleshoot incidents, develop customer relationships, and collaborate on knowledge base enhancement using various technologies.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nApply organizations processes to provide efficient, personalized support for both Tunisian and foreign clients.\nMonitor, troubleshoot and resolve application incidents reported by the client with respect of fixed SLA and deadlines.\nPrioritize and categorize incidents.\nTrack and document issues and resolutions.\nTroubleshoot issues by using the organizations knowledge base and other resources available.\nCollaborate in developing and enriching the organization knowledge base.\nGenerate necessary reports required by the IT department and/or the client.\nHandle escalation and coordination with R&D engineers.\nHandle communication with clients and other support levels.\nHandle new features development and configuration using the system tools and based on client change requests."
    },
    {
      "url": "https://www.naukrigulf.com/revenue-management-analyst-jobs-in-tunis-tunisia-in-vneuron-0-to-2-years-n-cd-10009202-jid-230126501479",
      "title": "Revenue Management Analyst",
      "company": "Vneuron",
      "experience": "0 - 2 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Monitor and analyze revenue performance, support forecasting models, collaborate with teams, and produce reports; requires strong analytical skills and proficiency in Excel.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMonitor, analyze, and drive revenue performance (MRR, TTM, churn, upsell/cross-sell).\nSupport the design and improvement of forecasting models.\nCollaborate with sales, finance, and product teams to optimize performance.\nProduce regular reports and ad hoc analyses for management.\nInspect ERP data for errors and recommend corrective actions.\nEnsure revenue accuracy by validating financials against contracts.\nPerform variance analysis and provide insights for management.\nContribute to the continuous improvement of revenue management processes."
    },
    {
      "url": "https://www.naukrigulf.com/head-of-r-d-engineering-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501476",
      "title": "Head of R&D Engineering",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Collaborate with the Chief Technology Officer to shape product strategy, lead engineering teams, and develop software using JAVA frameworks and agile methodologies.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nWork along with the CTO to set the roadmap and ensure its proper implementation\nParticipate in shaping product strategy and making technical decisions\nArchitect and develop new functionalities\nCoach and lead technically our engineering team\nEvaluate and improve the performance, maintainability, and security of applications in production.\nWork in an agile environment\nParticipate in team development\nLeading, planning and budgeting projects\nWhat You Wont Be Doing\nYou will not be making any decisions based primarily on saving money.\nYou will not participate in pointless or ineffective meetings. So we give you the time and resources to live your passion.\nYou will not be talking to customers.\nYou will definitely not receive demands from people who dont understand the trade.\nRequired profile\nSignificant experience in the field of software\nSignificant experience with JAVA frameworks (Spring, Hibernate) and Frontendbr>\ntechnologies (Angular, Typescript).\nKnowledge of Elasticsearch and Postgresql technologies\nSolid foundation in computer science, with strong competencies in algorithms, data structures, software design, and building large, distributed systems.\nA good technical curiosity to ensure permanent watch of the most recentbr>\ntechnologies.\nProactive and having a problem-solving mindset\nA good experience in engineering leadership roles\nAbility to guide team members towards optimal problem solving\nAbility to work in an agile environment\nVery good at explaining why and how"
    },
    {
      "url": "https://www.naukrigulf.com/java-technical-lead-jobs-in-tunis-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501475",
      "title": "Java Technical Lead",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Lead and supervise a team in Java development, ensuring code quality, guiding junior developers, and participating in technology choices and software design.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nLead and Supervise technically your team\nGuide your Team through technical issues and challenges\nParticipate in technological choices, design and development of Vneurons products and projects.\nEnsure good code quality and respect the best practices of modern coding\nDevelop work schedules and establish the load and time estimates\nDevelop new software functionalities\nkeep up to date with industry trends\nBring the fruits of your experience to improve the collective effectiveness of the team\nContribute to the recruitment of young developers"
    },
    {
      "url": "https://www.naukrigulf.com/software-business-analyst-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501473",
      "title": "Software Business Analyst",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Analyze customer needs, define solutions, prepare specifications, coordinate teams, and train users, requiring strong communication and analytical skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAnalyze needs, shape solutions, gather and define requirements, lead business discussions, prepare functional specs, align R&D, QA and delivery, coordinate teams and train end-users to ensure smooth adoption and customer satisfaction.\nYou will have the opportunity to work on exciting projects that are generating a positive impact around the world. We believe that every person is unique and special. Thus, we provide an attentive and active listening to your ideas and propositions as we believe that you will have an essential role in shaping the future of Vneuron's value proposition.\nWhat you will be doing ?\nIdentify and collect customers requirements\nConduct business meetings to analyze and frame customers need\nConceive and define the optimal solution for customer need\nPrepare detailed functionnal specifications of the project\nEnsure clear understanding of customers requirements by r&d, QA, and delivery teams\nCoordinate with multidisciplinary teams to ensure customer satisfaction\nEnsure workshops to train final user about our software"
    },
    {
      "url": "https://www.naukrigulf.com/solution-architect-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126501470",
      "title": "Solution Architect",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Design solutions and roadmaps, debug issues, document best practices, and communicate with stakeholders; requires software engineering diploma and expertise in JAVA frameworks a...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nDesigning and recommending solutions along with roadmaps for proposed implementations.\nDebugging issues and generating performance analyses for deployed solutions.\nDocumenting and sharing best practices while advocating for process improvements.\nCommunicating with teams, clients, and project stakeholders while providing technical oversight at all project stages."
    },
    {
      "url": "https://www.naukrigulf.com/accounting-assistant-jobs-in-tunis-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126501465",
      "title": "Accounting Assistant",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Manage accounts payable, payroll, and expense reports while ensuring compliance; requires a degree in accounting and strong computer skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nEnsure accounts payable, invoice and expense entry, prepare social and tax declarations, manage payroll, leave and expense reports, while guaranteeing compliance and efficiency in a dynamic environment.\nManage accounts payable, including the entry of purchase invoices, overhead costs and fixed assets.\nClassifying and sorting accounting documents\nPrepare social and tax declarations\nTrack and record expense reports.\nManage leave and monitor absences (schedules, absences, paid leave)\nManage payroll and all administrative aspects (preparation, data entry, calculation, verification)\nConfigure the payroll tool and monitor regulatory changes and the application of social legislation."
    },
    {
      "url": "https://www.naukrigulf.com/growth-hacker-jobs-in-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126501462",
      "title": "Growth Hacker",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Research and identify growth opportunities, optimize marketing tactics, and analyze competitive landscapes while requiring a bachelor's degree and strong communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMissions / What you will do\nResearching and understanding the company's long-term goals.\nPinpointing issues that are hampering growth for the business.\nChoosing, setting, and prioritizing growth goals for the company.\nIdentifying growth opportunities for the company.\nTesting and optimizing marketing tactics for customer acquisition and conversion rate optimization\nConducting and presenting competitive analyses and market research\nProposing new initiatives to attract prospects and convert leads as well as testing new approaches to capture existing demand\nTranslating ideas to actionable items that deliver business results\nAnalyzing, recommending and lead the implementation of improvement initiatives\nKeep abreast with the latest trends and changes in the digital marketing"
    },
    {
      "url": "https://www.naukrigulf.com/cyber-security-analyst-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501459",
      "title": "Cyber Security Analyst",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Assist in vulnerability management, update security policies, support incident response, and contribute to Zero Trust initiatives while possessing a diploma in Cyber Security.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nAs a Cyber Security Analyst, you will:\nAssist with the setup and day-to-day management of tools for vulnerability management and threat detection.\nHelp update and maintain security policies, procedures, and standards to stay compliant with best practices and regulations.\nSupport SIEM/SOAR operations by tuning alerts, adjusting rules, and working with DevOps on incident triage.\nTake part in post-incident reviews to evaluate and improve our security controls.\nWork closely with R&D and DevOps to ensure strong access controls, endpoint protection, and patch management.\nUse tools like Microsoft Defender and Azure Security Center to help prioritize remediation efforts based on risk.\nContribute to the rollout and improvement of Zero Trust security initiatives.\nMonitor logs across systems, firewalls, and applications to support timely detection and response to potential threats.\nParticipate in regular risk assessments, documenting findings and suggesting actionable improvements.\nJoin incident response reviews and help implement lessons learned to prevent future issues.\nExplore new security tools and automation opportunities to help us stay ahead of threats.\n\n\nWhy Join Us?\nMake an Impact: Youll help protect critical systems, data, and infrastructure from real-world threats.\nWork with Modern Tools: We use the latest in cloud-native security, automation, and DevSecOps practices."
    },
    {
      "url": "https://www.naukrigulf.com/sales-development-representative-jobs-in-tunis-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126501455",
      "title": "Sales Development Representative",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for lead generation, customer relationship management, and market intelligence; requires strong analytical skills and proficiency in multiple languages.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nProspecting, Lead generation, and new customer relationships establishment\nMarket and competitive intelligence\nIdentifying customer needs\nPresenting our company and its products to stimulate the interest of prospects for a Proof Of Concept demo\nExploitation of Vneruon CRM to log and update all activities\nCustomer Proposal Management\nWork closely with the Account Management team to convert detected opportunities into new customers"
    },
    {
      "url": "https://www.naukrigulf.com/english-speaker-lead-generation-specialist-jobs-in-tunisia-in-vneuron-1-to-3-years-n-cd-10009202-jid-230126501453",
      "title": "English Speaker Lead Generation Specialist",
      "company": "Vneuron",
      "experience": "1 - 3 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsibilities include data cleaning, lead sourcing, data enrichment, qualification, and collaboration with sales and marketing teams; requires analytical skills and excellent...",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nMissions / What you will do\nData Cleaning and Maintenance:\nRegularly review and clean CRM data to ensure accuracy and completeness.\nIdentify and rectify any inconsistencies or errors within the database\nLead Sourcing:\nUtilize various sources to identify and gather potential leads for different sectors and regions.\nImplement effective strategies to maximize lead generation efforts.\nData Enrichment:\nEnhance CRM data by gathering additional information relevant to leads, including industry trends, company news, and contact details.\nQualification:\nEvaluate lead quality and relevance to ensure alignment with our target audience.\nImplement lead scoring methods to prioritize high-potential leads.\nCollaboration:\nWork closely with the sales and marketing teams to align lead generation efforts with overall business objectives.\nProvide regular updates on lead generation metrics and performance."
    },
    {
      "url": "https://www.naukrigulf.com/systems-and-network-administrator-jobs-in-tunis-tunisia-in-vneuron-2-to-7-years-n-cd-10009202-jid-230126500106",
      "title": "Systems and Network Administrator",
      "company": "Vneuron",
      "experience": "2 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Install, configure and deploy hardware, provide technical support, manage inventory, requiring strong analytical skills and knowledge of Linux and Windows environments.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nInstall, configure and deploy computer hardware and security equipment, assist users, resolve technical issues, manage IT purchases and monitor inventory to ensure smooth operation.\n\n\nAssignment :\nAssemble, install and commission new computer hardware and security equipment.\nProvide technical support to users.\nDiagnose and resolve equipment malfunctions.\nOrdering computer equipment.\nMonitor stock levels.\n\nRequired skills:\nLinux and Windows environments.\nGood knowledge of LAN networks.\nPassionate about new technologies.\nVersatile, rigorous and well organized\nAbility to work under pressure.\nAbility to manage emergencies.\n\nWhat do we propose?\nThe opportunity to work in stimulating environments and contribute to a positive impact on a global scale\nOpportunities for career advancement and development\nHealth and wellness benefits for you and your family\nA dynamic and pleasant environment, fostering the acquisition of new skills\nWorking conditions adapted to allow you to focus on what you love doing\nA high-performing team built on respect, sharing, and a passion for the profession\nEqual opportunities in employment, without distinction of gender, religion, culture or other\n\nNext step\nDo you have the audacity and the will to succeed? Don't wait any longer, come and contribute to your success and ours!\n\nFollow us on LinkedIn to learn more about our Spark team and our solutions."
    },
    {
      "url": "https://www.naukrigulf.com/senior-software-qa-engineer-jobs-in-tunisia-in-vneuron-5-to-7-years-n-cd-10009202-jid-230126500105",
      "title": "Senior Software QA Engineer",
      "company": "Vneuron",
      "experience": "5 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for defining Quality Assurance processes, developing test plans, conducting test automation, and collaborating with teams to ensure quality software delivery.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nSoftware Quality testing is a necessity as we believe that it is the key to reach perfection. Your main mission will be to prove that our software is broken and to detect its failures and defects.\nYour will :\nDefine and drive the Quality Assurance processes using both manual and automated testing.\nDevelop software test plans and perform test validation scenarios\nDevelop and conduct test automation scripts\nLead the team on technical aspects and participate in its development\nIdentify, document and track anomalies and non-conformances\nReview technical specifications\nEnsure quality deliveries and respect of project requirements\nCollaborate with multidisciplinary teams : Product, r&d, BA, delivery\nEnsure a continuous improvement of our QA process\nProvide regular reports\nMake it work, make it right, make it fast.i> em> Kent Beck/em> /i>"
    },
    {
      "url": "https://www.naukrigulf.com/specialist-in-sales-prospecting-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500104",
      "title": "Specialist in Sales Prospecting",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsibilities include lead generation, client relationship building, and market monitoring; requires strong analytical skills and proficiency in French and English.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nProposed Missions\n\nProspecting, lead generation and establishing new relationships with clients.\nMonitoring the market and the competition.\nDetermine customer needs.\nPresenting our company and its products to stimulate the interest of prospects for a proof-of-concept demonstration.\nUsing Vneuron CRM to record and update all activities.\nManaging customer proposals.\nWorking closely with the account management team to convert identified opportunities into new clients.\n\n\nDesired profile\n\nA degree in French language, computer science, finance or a huge interest in these three fields.\nYou have strong analytical and problem-solving skills.\nYou have excellent interpersonal and communication skills.\nYou are dynamic and enterprising.\nAn excellent level of written and spoken French is imperative.\nA good level of English is appreciated.\nA good level in a third language (Spanish, Turkish, Portuguese).\nA strong interest and desire to progress in the commercial field.\nUnderstanding the sales process is an asset."
    },
    {
      "url": "https://www.naukrigulf.com/account-manager-jobs-in-tunisia-in-vneuron-5-to-10-years-n-cd-10009202-jid-230126500101",
      "title": "Account Manager",
      "company": "Vneuron",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Lead client relationships, drive sales cycles, and ensure customer nurturing with excellent negotiation skills and strong communication in English and French.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nLead impactful client relationships by identifying opportunities, shaping tailored solutions, driving the full sales cycle and closing strategic deals, while representing our company with excellence and delivering insightful reporting.\nVneuron is a fast-growing RegTech company helping financial institutions stay ahead of compliance and risk challenges. Our solution, Reis RCS, supports banks and financial services in fighting financial crime through advanced technology.\nIn 2025, Vneuron was named among the Top Innovators in the FinCrimeTech50 and won the Best Compliance as a Service Solution at the RegTech Insight Awards Europe. Weve also been recognized in the RegTech100 for the fourth year in a row on a global list of the most innovative companies in the field.\nIf you're looking to join a team thats making a real impact in the world of compliance and technology, Vneuron is the place to be.\nVneuron puts the development of its team at the heart of its priorities. We provide a pleasant and comfortable work environment. Our organizational structure is flat and collaborative, and our management is available and present.\nWe invite you to be part of a passionate and committed young team who values respect and sharing spirit. You will be surrounded by highly skilled technical and functional experts willing to guide you to evolve in all aspects of your career.\nWe believe that every person is unique and special. Thus, we provide attentive and active listening to your ideas and propositions as we believe that you will have an essential role in achieving our next milestone and shaping the future of Vneurons value proposition.\nWhat you will be doing\nProspect territories and Qualify Business opportunities\nParticipate in Business Development Strategies\nEnsure Customer Nurturing by developing good relationships with potential interlocutors\nParticipate in well responding to proposals with the collaboration of the presales team\nAnalyze prospects' and customers need\nRepresent our Company and products\nEnsure the coordination and supervision of the whole sale process\nEnsure financial negotiations and contracts conclusion\nPrepare regular reporting\nWhat do we offer?\nThe opportunity to work in exciting contexts and to help generate a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment that challenges you to develop new skills\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing, and Passion for what it does\nEqual Employment Opportunities no matter your gender, religious, culture, etc\nYour Next Steps\nIf you have the ambition to stimulate your career with new challenges while capitalizing on your potential and your perpetual thirst for learning, this job is for you.\nApply Now and become the next Spark!\nFollow us on LinkedIn to learn more about the Spark team and our Spark solutions.\nWe would be delighted to meet you and give you much more information!"
    },
    {
      "url": "https://www.naukrigulf.com/senior-accountant-jobs-in-tunisia-in-vneuron-3-to-5-years-n-cd-10009202-jid-230126500098",
      "title": "Senior Accountant",
      "company": "Vneuron",
      "experience": "3 - 5 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Manage general and analytical accounting, prepare monthly tax returns, ensure accounting consistency, and possess strong knowledge of Tunisian standards and payroll processes.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nTo manage general and analytical accounting , including the entry of accounting transactions of all kinds\nPrepare monthly tax and social security returns in compliance with regulatory deadlines.\nParticipate in the preparation of the monthly report\nPerform bank reconciliations\nEnsuring the consistency of accounting entries"
    },
    {
      "url": "https://www.naukrigulf.com/french-speaking-lead-generation-specialist-jobs-in-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500096",
      "title": "French-speaking Lead Generation Specialist",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "The role involves data cleaning, lead generation, and collaboration with sales teams, requiring strong analytical skills and excellent written French.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nVneuron prioritizes the development of its employees and enables its teams to work in optimal conditions.\nWe invite you to join a young, passionate team driven by a taste for challenge. We also uphold the values of respect , commitment , and growth .\nWe believe that each person is unique and special. Therefore, we listen carefully and actively to your ideas and suggestions because we believe you will play a vital role in the realization of our next step.\nYou will also be surrounded by technical and functional experts to help you progress in your professional career.\nTo strengthen our global presence, we are looking for a Lead Generation Specialist based in Tunisia.\nMissions, Proposals\nData cleaning and updating:\nRegularly review and clean CRM data to ensure accuracy and completeness.\nIdentify and correct any inconsistencies or errors in the database.\nMain supply:\nUse various sources to identify and gather potential leads for different sectors and regions.\nImplement effective strategies to maximize lead generation efforts.\nData enrichment:\nEnhance CRM data by collecting additional information relevant to prospects, including industry trends, company news, and contact information.\nQualification :\nevaluate the quality and relevance of the leads to ensure their alignment with our target audience.\nImplement prospect scoring methods to prioritize high-potential prospects.\nCollaboration :\nWorking closely with the sales and marketing teams to align lead generation efforts with overall business objectives.\nProvide regular updates on lead generation metrics and performance."
    },
    {
      "url": "https://www.naukrigulf.com/senior-customer-solutions-consultant-presales-engineer-jobs-in-tunis-tunisia-in-vneuron-1-to-7-years-n-cd-10009202-jid-230126500095",
      "title": "Senior Customer Solutions Consultant / Presales Engineer",
      "company": "Vneuron",
      "experience": "1 - 7 Years",
      "location": "Tunis - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Support sales productivity by qualifying leads, analyzing needs, preparing presentations, and collaborating with teams; requires IT background and strong communication skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\nThe Customer Solution Consultant supports sales productivity and deal flow by securing the technical win. He collaborates with sales, support, product, and development teams in order to propose the best-suited deals for potential prospects.\n\nMissions :\nQualify potential leads and sales opportunities.\nInvestigate and analyze prospects' needs.\nElaborate commercial propositions including technical and functional aspects.\nCollaborate with multidisciplinary teams to reach the needed information.\nPrepare high-quality Proof of Concept (POC) presentations for potential prospects demonstrating how we can satisfy their need and convince them with Vneurons solution.\nEnsure negotiations and Q/A sessions\nDrive market and competitive intelligence\n\nRequired profile :\nIT background\nSignificant experience in Pre-Sales position\nExcellent analytical and problem-solving skills\nExcellent interpersonal and communication skills\nDynamic, self-starter, curious and empathetic\nGood written and verbal English level\nGood written and verbal French level\nSharp, clear, and structured communicator\n\nNice to have:\nEngineering degree\nExperience in IT sales\nKnowledge in the Risk & Compliance field\n\n\n\nBenefits\nThe opportunity to work in exciting contexts and to help generate a positive impact around the world.\nCareer Growth opportunity\nHealthcare and wellness Benefits to you and your family\nAn evolving and pleasant environment that challenges you to develop new skills\nAppropriate conditions to help you focus on what you love doing\nA winning team that has relied on Respect, Sharing and Passion for what it does\nEqual Employment Opportunities no matter your gender, religion, culture, etc.\n\n\n\n\nNext steps\n\nIf you have the ambition to stimulate your career with new challenges while capitalizing on your potential and your perpetual thirst for learning, this job is for you.\n\nApply Now and become the next Spark!\n\nFollow us on LinkedIn to learn more about the Spark team and our Spark solutions.\nWe would be thrilled to meet you and give you much more information!"
    },
    {
      "url": "https://www.naukrigulf.com/risk-compliance-and-legal-officer-jobs-in-tunisia-in-vneuron-5-to-10-years-n-cd-10009202-jid-230126500094",
      "title": "Risk, Compliance and Legal Officer",
      "company": "Vneuron",
      "experience": "5 - 10 Years",
      "location": "Tunisia - Tunisia",
      "posted_date": "23 Jan",
      "description_preview": "Responsible for identifying compliance risks, preparing regulatory reports, and drafting agreements; requires a Master's degree and strong analytical skills.",
      "company_logo_url": "https://static.naukimg.com/ni/nipjp/10009202/10009202_srp.gif",
      "full_description": "Job Description\nRoles & Responsibilities\n1. Operational Tasks - RCCI\nIdentifying compliance risks\nUpdating the risk map\nWriting, analyzing, and enhancing the effectiveness and relevance of existing tools\nImplementing and executing the ongoing control strategy\nRegulatory monitoring: identifying national regulatory developments and international recommendations that could affect the company's operations\nTracking incidents and complaints\nManaging relationships with regulatory authorities\nPromoting ethical conduct\nEstablishing effective compliance programs\n2. Reporting\nPreparation of regulatory reports\nDevelopment of periodic activity reports, reporting, and documentation for our clients\nParticipation in committees/meetings\n3. Contractual aspects\nDrafting and updating product sales agreements with various partner institutions.\nMonitoring customer relationships.\nAssist in contract negotiations to achieve favorable terms and conditions.\nProvide guidance and support to internal stakeholders during the negotiation process."
    }
  ]
}